mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xe/common/s6e1b8xe.h
/*******************************************************************************
* \brief Interrupt number definition for all type MCUs
*******************************************************************************/
#define FM_INTERRUPT_TYPE                         0x012Au

#define IRQ_NMI_AVAILABLE                         1
#define IRQ_HARDFAULT_AVAILABLE                   1
#define IRQ_SVC_AVAILABLE                         1
#define IRQ_PENDSV_AVAILABLE                      1
#define IRQ_SYSTICK_AVAILABLE                     1

#define IRQ_CSV_AVAILABLE                         1
#define IRQ_SWDT_AVAILABLE                        1
#define IRQ_LVD_AVAILABLE                         1
#define IRQ_MFT0_WFG_DTIF_AVAILABLE               1
#define IRQ_EXINT0_7_AVAILABLE                    1
#define IRQ_EXINT8_23_AVAILABLE                   1
#define IRQ_DT_AVAILABLE                          1
#define IRQ_MFS0_RX_AVAILABLE                     1
#define IRQ_MFS0_TX_AVAILABLE                     1
#define IRQ_MFS1_RX_AVAILABLE                     1
#define IRQ_MFS1_TX_AVAILABLE                     1
#define IRQ_MFS2_RX_AVAILABLE                     1
#define IRQ_MFS2_TX_AVAILABLE                     1
#define IRQ_MFS3_RX_AVAILABLE                     1
#define IRQ_MFS3_TX_AVAILABLE                     1
#define IRQ_MFS4_RX_AVAILABLE                     1
#define IRQ_MFS4_TX_AVAILABLE                     1
#define IRQ_MFS5_RX_AVAILABLE                     1
#define IRQ_MFS5_TX_AVAILABLE                     1
#define IRQ_MFS6_RX_AVAILABLE                     1
#define IRQ_MFS6_TX_AVAILABLE                     1
#define IRQ_MFS7_RX_AVAILABLE                     1
#define IRQ_MFS7_TX_AVAILABLE                     1
#define IRQ_PPG00_02_20_DSTC_SMCIF0_HDMICEC0_AVAILABLE 1
#define IRQ_TIM_SMCIF1_HDMICEC1_AVAILABLE         1
#define IRQ_ADC0_AVAILABLE                        1
#define IRQ_USB0_F_AVAILABLE                      1
#define IRQ_LCDC_AVAILABLE                        1
#define IRQ_MFT0_FRT_AVAILABLE                    1
#define IRQ_USB0_F_MFT0_ICU_AVAILABLE             1
#define IRQ_MFT0_OCU_AVAILABLE                    1
#define IRQ_BT0_7_FLASHIF_AVAILABLE               1


typedef enum IRQn
{
    NMI_IRQn                                      =  -14, /* Non Maskable Interrupt NMI */
    HardFault_IRQn                                =  -13, /* HardFault HardFault */
    SVC_IRQn                                      =   -5, /* SV Call SVC */
    PendSV_IRQn                                   =   -2, /* Pend SV PendSV */
    SysTick_IRQn                                  =   -1, /* System Tick SysTick */

    CSV_IRQn                                      =    0, /* CSV_IRQ */
    SWDT_IRQn                                     =    1, /* SWDT_IRQ */
    LVD_IRQn                                      =    2, /* LVD_IRQ */
    MFT0_WFG_DTIF_IRQn                            =    3, /* MFT0_WFG_DTIF_IRQ */
    EXINT0_7_IRQn                                 =    4, /* EXINT0_7_IRQ */
    EXINT8_23_IRQn                                =    5, /* EXINT8_23_IRQ */
    DT_IRQn                                       =    6, /* DT_IRQ */
    MFS0_RX_IRQn                                  =    7, /* MFS0_RX_IRQ */
    MFS0_TX_IRQn                                  =    8, /* MFS0_TX_IRQ */
    MFS1_RX_IRQn                                  =    9, /* MFS1_RX_IRQ */
    MFS1_TX_IRQn                                  =   10, /* MFS1_TX_IRQ */
    MFS2_RX_IRQn                                  =   11, /* MFS2_RX_IRQ */
    MFS2_TX_IRQn                                  =   12, /* MFS2_TX_IRQ */
    MFS3_RX_IRQn                                  =   13, /* MFS3_RX_IRQ */
    MFS3_TX_IRQn                                  =   14, /* MFS3_TX_IRQ */
    MFS4_RX_IRQn                                  =   15, /* MFS4_RX_IRQ */
    MFS4_TX_IRQn                                  =   16, /* MFS4_TX_IRQ */
    MFS5_RX_IRQn                                  =   17, /* MFS5_RX_IRQ */
    MFS5_TX_IRQn                                  =   18, /* MFS5_TX_IRQ */
    MFS6_RX_IRQn                                  =   19, /* MFS6_RX_IRQ */
    MFS6_TX_IRQn                                  =   20, /* MFS6_TX_IRQ */
    MFS7_RX_IRQn                                  =   21, /* MFS7_RX_IRQ */
    MFS7_TX_IRQn                                  =   22, /* MFS7_TX_IRQ */
    PPG00_02_20_DSTC_SMCIF0_HDMICEC0_IRQn         =   23, /* PPG00_02_20_DSTC_SMCIF0_HDMICEC0_IRQ */
    TIM_SMCIF1_HDMICEC1_IRQn                      =   24, /* TIM_SMCIF1_HDMICEC1_IRQ */
    ADC0_IRQn                                     =   25, /* ADC0_IRQ */
    USB0_F_IRQn                                   =   26, /* USB0_F_IRQ */
    LCDC_IRQn                                     =   27, /* LCDC_IRQ */
    MFT0_FRT_IRQn                                 =   28, /* MFT0_FRT_IRQ */
    USB0_F_MFT0_ICU_IRQn                          =   29, /* USB0_F_MFT0_ICU_IRQ */
    MFT0_OCU_IRQn                                 =   30, /* MFT0_OCU_IRQ */
    BT0_7_FLASHIF_IRQn                            =   31, /* BT0_7_FLASHIF_IRQ */
} IRQn_Type;

#include "core_cm0plus.h"
#include <stdint.h>

/*******************************************************************************
* Device Specific Peripheral Registers structures
*******************************************************************************/
#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/*******************************************************************************
* ADC_MODULE
*******************************************************************************/
typedef struct stc_adc_adsr_field
{
        __IO   uint8_t  SCS                      :1;
        __IO   uint8_t  PCS                      :1;
        __IO   uint8_t  PCNS                     :1;
        __IO   uint8_t  RESERVED0                :3;
        __IO   uint8_t  FDAS                     :1;
        __IO   uint8_t  ADSTP                    :1;
} stc_adc_adsr_field_t;

typedef struct stc_adc_adcr_field
{
        __IO   uint8_t  OVRIE                    :1;
        __IO   uint8_t  CMPIE                    :1;
        __IO   uint8_t  PCIE                     :1;
        __IO   uint8_t  SCIE                     :1;
        __IO   uint8_t  RESERVED0                :1;
        __IO   uint8_t  CMPIF                    :1;
        __IO   uint8_t  PCIF                     :1;
        __IO   uint8_t  SCIF                     :1;
} stc_adc_adcr_field_t;

