mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xe/common/s6e1b8xe.h
typedef struct stc_lcdc_lcdc_blink_field
{
        __IO  uint16_t  BLD00                    :1;
        __IO  uint16_t  BLD01                    :1;
        __IO  uint16_t  BLD02                    :1;
        __IO  uint16_t  BLD03                    :1;
        __IO  uint16_t  BLD04                    :1;
        __IO  uint16_t  BLD05                    :1;
        __IO  uint16_t  BLD06                    :1;
        __IO  uint16_t  BLD07                    :1;
        __IO  uint16_t  BLD08                    :1;
        __IO  uint16_t  BLD09                    :1;
        __IO  uint16_t  BLD10                    :1;
        __IO  uint16_t  BLD11                    :1;
        __IO  uint16_t  BLD12                    :1;
        __IO  uint16_t  BLD13                    :1;
        __IO  uint16_t  BLD14                    :1;
        __IO  uint16_t  BLD15                    :1;
} stc_lcdc_lcdc_blink_field_t;

typedef struct stc_lcdc_lcdc_booster_field
{
    union {
        struct {
            __IO  uint16_t  BSTOPT               :1;
            __IO  uint16_t  BSTPD                :1;
            __IO  uint16_t  PSF                  :1;
            __IO  uint16_t  CENSEL               :1;
            __IO  uint16_t  RESERVED0            :4;
            __IO  uint16_t  BTRF                 :4;
            __IO  uint16_t  BTRC                 :2;
            __IO  uint16_t  RESERVED2            :2;
        };
        struct {
            __IO  uint16_t  RESERVED1            :8;
            __IO  uint16_t  BTRF0                :1;
            __IO  uint16_t  BTRF1                :1;
            __IO  uint16_t  BTRF2                :1;
            __IO  uint16_t  BTRF3                :1;
            __IO  uint16_t  BTRC0                :1;
            __IO  uint16_t  BTRC1                :1;
            __IO  uint16_t  RESERVED3            :2;
        };
    };
} stc_lcdc_lcdc_booster_field_t;

typedef struct stc_lcdc_lcdram00_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram00_field_t;

typedef struct stc_lcdc_lcdram01_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram01_field_t;

typedef struct stc_lcdc_lcdram02_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram02_field_t;

typedef struct stc_lcdc_lcdram03_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram03_field_t;

typedef struct stc_lcdc_lcdram04_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram04_field_t;

typedef struct stc_lcdc_lcdram05_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram05_field_t;

typedef struct stc_lcdc_lcdram06_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram06_field_t;

typedef struct stc_lcdc_lcdram07_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram07_field_t;

