mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xe/common/s6e1b8xe.h
/*******************************************************************************
* LSCRP_MODULE
*******************************************************************************/
typedef struct stc_lscrp_lcr_prsld_field
{
    union {
        struct {
            __IO   uint8_t  LCR_PRSLD            :6;
            __IO   uint8_t  RESERVED0            :2;
        };
        struct {
            __IO   uint8_t  LCR_PRSLD0           :1;
            __IO   uint8_t  LCR_PRSLD1           :1;
            __IO   uint8_t  LCR_PRSLD2           :1;
            __IO   uint8_t  LCR_PRSLD3           :1;
            __IO   uint8_t  LCR_PRSLD4           :1;
            __IO   uint8_t  LCR_PRSLD5           :1;
            __IO   uint8_t  RESERVED1            :2;
        };
    };
} stc_lscrp_lcr_prsld_field_t;

/*******************************************************************************
* LVD_MODULE
*******************************************************************************/
typedef struct stc_lvd_lvd_ctl_field
{
    union {
        struct {
            __IO  uint16_t  RESERVED0            :2;
            __IO  uint16_t  SVHI                 :5;
            __IO  uint16_t  LVDIE                :1;
            __IO  uint16_t  RESERVED2            :7;
            __IO  uint16_t  LVDRE                :1;
        };
        struct {
            __IO  uint16_t  RESERVED1            :2;
            __IO  uint16_t  SVHI0                :1;
            __IO  uint16_t  SVHI1                :1;
            __IO  uint16_t  SVHI2                :1;
            __IO  uint16_t  SVHI3                :1;
            __IO  uint16_t  SVHI4                :1;
            __IO  uint16_t  RESERVED3            :9;
        };
    };
} stc_lvd_lvd_ctl_field_t;

typedef struct stc_lvd_lvd_str_field
{
        __IO  uint16_t  LVDHSTR                  :1;
        __IO  uint16_t  RESERVED0                :6;
        __IO  uint16_t  LVDIR                    :1;
        __IO  uint16_t  LVD2HSTR                 :1;
        __IO  uint16_t  RESERVED1                :6;
        __IO  uint16_t  LVD2IR                   :1;
} stc_lvd_lvd_str_field_t;

typedef struct stc_lvd_lvd_clr_field
{
        __IO  uint16_t  RESERVED0                :7;
        __IO  uint16_t  LVDCL                    :1;
        __IO  uint16_t  RESERVED1                :7;
        __IO  uint16_t  LVD2CL                   :1;
} stc_lvd_lvd_clr_field_t;

typedef struct stc_lvd_lvd_rlr_field
{
    union {
        struct {
            __IO  uint32_t  LVDLCK               :32;
        };
        struct {
            __IO  uint32_t  LVDLCK0              :1;
            __IO  uint32_t  LVDLCK1              :1;
            __IO  uint32_t  LVDLCK2              :1;
            __IO  uint32_t  LVDLCK3              :1;
            __IO  uint32_t  LVDLCK4              :1;
            __IO  uint32_t  LVDLCK5              :1;
            __IO  uint32_t  LVDLCK6              :1;
            __IO  uint32_t  LVDLCK7              :1;
            __IO  uint32_t  LVDLCK8              :1;
            __IO  uint32_t  LVDLCK9              :1;
            __IO  uint32_t  LVDLCK10             :1;
            __IO  uint32_t  LVDLCK11             :1;
            __IO  uint32_t  LVDLCK12             :1;
            __IO  uint32_t  LVDLCK13             :1;
            __IO  uint32_t  LVDLCK14             :1;
            __IO  uint32_t  LVDLCK15             :1;
            __IO  uint32_t  LVDLCK16             :1;
            __IO  uint32_t  LVDLCK17             :1;
            __IO  uint32_t  LVDLCK18             :1;
            __IO  uint32_t  LVDLCK19             :1;
            __IO  uint32_t  LVDLCK20             :1;
            __IO  uint32_t  LVDLCK21             :1;
            __IO  uint32_t  LVDLCK22             :1;
            __IO  uint32_t  LVDLCK23             :1;
            __IO  uint32_t  LVDLCK24             :1;
            __IO  uint32_t  LVDLCK25             :1;
            __IO  uint32_t  LVDLCK26             :1;
            __IO  uint32_t  LVDLCK27             :1;
            __IO  uint32_t  LVDLCK28             :1;
            __IO  uint32_t  LVDLCK29             :1;
            __IO  uint32_t  LVDLCK30             :1;
            __IO  uint32_t  LVDLCK31             :1;
        };
    };
} stc_lvd_lvd_rlr_field_t;

typedef struct stc_lvd_lvd_str2_field
{
        __IO  uint16_t  RESERVED0                :6;
        __IO  uint16_t  LVDRRDY                  :1;
        __IO  uint16_t  LVDIRDY                  :1;
        __IO  uint16_t  RESERVED1                :7;
        __IO  uint16_t  LVD2IRDY                 :1;
} stc_lvd_lvd_str2_field_t;

typedef struct stc_lvd_lvd_ctl2_field
{
    union {
        struct {
            __IO  uint16_t  RESERVED0            :2;
            __IO  uint16_t  SVHRLI               :5;
            __IO  uint16_t  LVDRLIE              :1;
            __IO  uint16_t  LVDPOL               :1;
            __IO  uint16_t  RESERVED2            :7;
        };
        struct {
            __IO  uint16_t  RESERVED1            :2;
            __IO  uint16_t  SVHRLI0              :1;
            __IO  uint16_t  SVHRLI1              :1;
            __IO  uint16_t  SVHRLI2              :1;
            __IO  uint16_t  SVHRLI3              :1;
            __IO  uint16_t  SVHRLI4              :1;
            __IO  uint16_t  RESERVED3            :9;
        };
    };
} stc_lvd_lvd_ctl2_field_t;

typedef struct stc_lvd_lvd2_ctl_field
{
    union {
        struct {
            __IO  uint16_t  RESERVED0            :2;
            __IO  uint16_t  SVH2I                :5;
            __IO  uint16_t  LVD2IE               :1;
            __IO  uint16_t  RESERVED2            :8;
        };
        struct {
            __IO  uint16_t  RESERVED1            :2;
            __IO  uint16_t  SVH2I0               :1;
            __IO  uint16_t  SVH2I1               :1;
            __IO  uint16_t  SVH2I2               :1;
            __IO  uint16_t  SVH2I3               :1;
            __IO  uint16_t  SVH2I4               :1;
            __IO  uint16_t  RESERVED3            :9;
        };
    };
} stc_lvd_lvd2_ctl_field_t;

typedef struct stc_lvd_lvd2_ctl2_field
{
    union {
        struct {
            __IO  uint16_t  RESERVED0            :2;
            __IO  uint16_t  SVH2RLI              :5;
            __IO  uint16_t  LVD2RLIE             :1;
            __IO  uint16_t  LVD2POL              :1;
            __IO  uint16_t  RESERVED2            :7;
        };
        struct {
            __IO  uint16_t  RESERVED1            :2;
            __IO  uint16_t  SVH2RLI0             :1;
            __IO  uint16_t  SVH2RLI1             :1;
            __IO  uint16_t  SVH2RLI2             :1;
            __IO  uint16_t  SVH2RLI3             :1;
            __IO  uint16_t  SVH2RLI4             :1;
            __IO  uint16_t  RESERVED3            :9;
        };
    };
} stc_lvd_lvd2_ctl2_field_t;

