mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xe/common/s6e1b8xe.h
typedef struct stc_smcif_guardtimer_field
{
    union {
        struct {
            __IO  uint16_t  GTREG                :8;
            __IO  uint16_t  RESERVED0            :8;
        };
        struct {
            __IO  uint16_t  GTREG0               :1;
            __IO  uint16_t  GTREG1               :1;
            __IO  uint16_t  GTREG2               :1;
            __IO  uint16_t  GTREG3               :1;
            __IO  uint16_t  GTREG4               :1;
            __IO  uint16_t  GTREG5               :1;
            __IO  uint16_t  GTREG6               :1;
            __IO  uint16_t  GTREG7               :1;
            __IO  uint16_t  RESERVED1            :8;
        };
    };
} stc_smcif_guardtimer_field_t;

typedef struct stc_smcif_idletimer_field
{
    union {
        struct {
            __IO  uint16_t  IDTREG               :16;
        };
        struct {
            __IO  uint16_t  IDTREG0              :1;
            __IO  uint16_t  IDTREG1              :1;
            __IO  uint16_t  IDTREG2              :1;
            __IO  uint16_t  IDTREG3              :1;
            __IO  uint16_t  IDTREG4              :1;
            __IO  uint16_t  IDTREG5              :1;
            __IO  uint16_t  IDTREG6              :1;
            __IO  uint16_t  IDTREG7              :1;
            __IO  uint16_t  IDTREG8              :1;
            __IO  uint16_t  IDTREG9              :1;
            __IO  uint16_t  IDTREG10             :1;
            __IO  uint16_t  IDTREG11             :1;
            __IO  uint16_t  IDTREG12             :1;
            __IO  uint16_t  IDTREG13             :1;
            __IO  uint16_t  IDTREG14             :1;
            __IO  uint16_t  IDTREG15             :1;
        };
    };
} stc_smcif_idletimer_field_t;

typedef struct stc_smcif_globalcontrol2_field
{
        __IO  uint16_t  RX8N1                    :1;
        __IO  uint16_t  INVDATAOUT               :1;
        __IO  uint16_t  RESERVED0                :1;
        __IO  uint16_t  ICCDISABLE               :1;
        __IO  uint16_t  RESERVED1                :12;
} stc_smcif_globalcontrol2_field_t;

typedef struct stc_smcif_data_fifo_field
{
    union {
        struct {
            __IO  uint16_t  DATA                 :9;
            __IO  uint16_t  RESERVED0            :7;
        };
        struct {
            __IO  uint16_t  DATA0                :1;
            __IO  uint16_t  DATA1                :1;
            __IO  uint16_t  DATA2                :1;
            __IO  uint16_t  DATA3                :1;
            __IO  uint16_t  DATA4                :1;
            __IO  uint16_t  DATA5                :1;
            __IO  uint16_t  DATA6                :1;
            __IO  uint16_t  DATA7                :1;
            __IO  uint16_t  DATA8                :1;
            __IO  uint16_t  RESERVED1            :7;
        };
    };
} stc_smcif_data_fifo_field_t;

typedef struct stc_smcif_fifo_level_read_field
{
    union {
        struct {
            __IO  uint16_t  FIFORDLEVEL          :16;
        };
        struct {
            __IO  uint16_t  FIFORDLEVEL0         :1;
            __IO  uint16_t  FIFORDLEVEL1         :1;
            __IO  uint16_t  FIFORDLEVEL2         :1;
            __IO  uint16_t  FIFORDLEVEL3         :1;
            __IO  uint16_t  FIFORDLEVEL4         :1;
            __IO  uint16_t  FIFORDLEVEL5         :1;
            __IO  uint16_t  FIFORDLEVEL6         :1;
            __IO  uint16_t  FIFORDLEVEL7         :1;
            __IO  uint16_t  FIFORDLEVEL8         :1;
            __IO  uint16_t  FIFORDLEVEL9         :1;
            __IO  uint16_t  FIFORDLEVEL10        :1;
            __IO  uint16_t  FIFORDLEVEL11        :1;
            __IO  uint16_t  FIFORDLEVEL12        :1;
            __IO  uint16_t  FIFORDLEVEL13        :1;
            __IO  uint16_t  FIFORDLEVEL14        :1;
            __IO  uint16_t  FIFORDLEVEL15        :1;
        };
    };
} stc_smcif_fifo_level_read_field_t;

typedef struct stc_smcif_fifo_level_write_field
{
    union {
        struct {
            __IO  uint16_t  FIFOWRLEVEL          :16;
        };
        struct {
            __IO  uint16_t  FIFOWRLEVEL0         :1;
            __IO  uint16_t  FIFOWRLEVEL1         :1;
            __IO  uint16_t  FIFOWRLEVEL2         :1;
            __IO  uint16_t  FIFOWRLEVEL3         :1;
            __IO  uint16_t  FIFOWRLEVEL4         :1;
            __IO  uint16_t  FIFOWRLEVEL5         :1;
            __IO  uint16_t  FIFOWRLEVEL6         :1;
            __IO  uint16_t  FIFOWRLEVEL7         :1;
            __IO  uint16_t  FIFOWRLEVEL8         :1;
            __IO  uint16_t  FIFOWRLEVEL9         :1;
            __IO  uint16_t  FIFOWRLEVEL10        :1;
            __IO  uint16_t  FIFOWRLEVEL11        :1;
            __IO  uint16_t  FIFOWRLEVEL12        :1;
            __IO  uint16_t  FIFOWRLEVEL13        :1;
            __IO  uint16_t  FIFOWRLEVEL14        :1;
            __IO  uint16_t  FIFOWRLEVEL15        :1;
        };
    };
} stc_smcif_fifo_level_write_field_t;

typedef struct stc_smcif_fifo_mode_field
{
    union {
        struct {
            __IO  uint16_t  FIFOEN               :1;
            __IO  uint16_t  RDFIFOOVRIRQEN       :1;
            __IO  uint16_t  WRFIFOIRQEN          :1;
            __IO  uint16_t  RDFIFOIRQEN          :1;
            __IO  uint16_t  RESERVED0            :4;
            __IO  uint16_t  WRFIFOLEVEL          :4;
            __IO  uint16_t  RDFIFOLEVEL          :4;
        };
        struct {
            __IO  uint16_t  RESERVED1            :8;
            __IO  uint16_t  WRFIFOLEVEL0         :1;
            __IO  uint16_t  WRFIFOLEVEL1         :1;
            __IO  uint16_t  WRFIFOLEVEL2         :1;
            __IO  uint16_t  WRFIFOLEVEL3         :1;
            __IO  uint16_t  RDFIFOLEVEL0         :1;
            __IO  uint16_t  RDFIFOLEVEL1         :1;
            __IO  uint16_t  RDFIFOLEVEL2         :1;
            __IO  uint16_t  RDFIFOLEVEL3         :1;
        };
    };
} stc_smcif_fifo_mode_field_t;

