mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xe/common/s6e1b8xe.h
/*******************************************************************************
* FLASH_IF Registers FLASH_IF
*   Register Definition
*******************************************************************************/
#define FM_FLASH_IF_FRWTR                         *((volatile uint32_t*)(0x40000004UL))
#define FM0P_FLASH_IF_FRWTR                       *((volatile uint32_t*)(0x40000004UL))
#define FM_FLASH_IF_FSTR                          *((volatile uint32_t*)(0x40000008UL))
#define FM0P_FLASH_IF_FSTR                        *((volatile uint32_t*)(0x40000008UL))
#define FM_FLASH_IF_FRVRC                         *((volatile uint32_t*)(0x4000000CUL))
#define FM0P_FLASH_IF_FRVRC                       *((volatile uint32_t*)(0x4000000CUL))
#define FM_FLASH_IF_FSYNDN                        *((volatile uint32_t*)(0x40000010UL))
#define FM0P_FLASH_IF_FSYNDN                      *((volatile uint32_t*)(0x40000010UL))
#define FM_FLASH_IF_FICR                          *((volatile uint32_t*)(0x40000020UL))
#define FM0P_FLASH_IF_FICR                        *((volatile uint32_t*)(0x40000020UL))
#define FM_FLASH_IF_FISR                          *((volatile uint32_t*)(0x40000024UL))
#define FM0P_FLASH_IF_FISR                        *((volatile uint32_t*)(0x40000024UL))
#define FM_FLASH_IF_FICLR                         *((volatile uint32_t*)(0x40000028UL))
#define FM0P_FLASH_IF_FICLR                       *((volatile uint32_t*)(0x40000028UL))
#define FM_FLASH_IF_CRTRMM                        *((volatile uint32_t*)(0x40000100UL))
#define FM0P_FLASH_IF_CRTRMM                      *((volatile uint32_t*)(0x40000100UL))

/*******************************************************************************
* GPIO Registers GPIO
*   Register Definition
*******************************************************************************/
#define FM_GPIO_PFR0                              *((volatile uint32_t*)(0x40033000UL))
#define FM0P_GPIO_PFR0                            *((volatile uint32_t*)(0x40033000UL))
#define FM_GPIO_PFR1                              *((volatile uint32_t*)(0x40033004UL))
#define FM0P_GPIO_PFR1                            *((volatile uint32_t*)(0x40033004UL))
#define FM_GPIO_PFR2                              *((volatile uint32_t*)(0x40033008UL))
#define FM0P_GPIO_PFR2                            *((volatile uint32_t*)(0x40033008UL))
#define FM_GPIO_PFR3                              *((volatile uint32_t*)(0x4003300CUL))
#define FM0P_GPIO_PFR3                            *((volatile uint32_t*)(0x4003300CUL))
#define FM_GPIO_PFR4                              *((volatile uint32_t*)(0x40033010UL))
#define FM0P_GPIO_PFR4                            *((volatile uint32_t*)(0x40033010UL))
#define FM_GPIO_PFR5                              *((volatile uint32_t*)(0x40033014UL))
#define FM0P_GPIO_PFR5                            *((volatile uint32_t*)(0x40033014UL))
#define FM_GPIO_PFR6                              *((volatile uint32_t*)(0x40033018UL))
#define FM0P_GPIO_PFR6                            *((volatile uint32_t*)(0x40033018UL))
#define FM_GPIO_PFR7                              *((volatile uint32_t*)(0x4003301CUL))
#define FM0P_GPIO_PFR7                            *((volatile uint32_t*)(0x4003301CUL))
#define FM_GPIO_PFR8                              *((volatile uint32_t*)(0x40033020UL))
#define FM0P_GPIO_PFR8                            *((volatile uint32_t*)(0x40033020UL))
#define FM_GPIO_PFR9                              *((volatile uint32_t*)(0x40033024UL))
#define FM0P_GPIO_PFR9                            *((volatile uint32_t*)(0x40033024UL))
#define FM_GPIO_PFRA                              *((volatile uint32_t*)(0x40033028UL))
#define FM0P_GPIO_PFRA                            *((volatile uint32_t*)(0x40033028UL))
#define FM_GPIO_PFRB                              *((volatile uint32_t*)(0x4003302CUL))
#define FM0P_GPIO_PFRB                            *((volatile uint32_t*)(0x4003302CUL))
#define FM_GPIO_PFRC                              *((volatile uint32_t*)(0x40033030UL))
#define FM0P_GPIO_PFRC                            *((volatile uint32_t*)(0x40033030UL))
#define FM_GPIO_PFRD                              *((volatile uint32_t*)(0x40033034UL))
#define FM0P_GPIO_PFRD                            *((volatile uint32_t*)(0x40033034UL))
#define FM_GPIO_PFRE                              *((volatile uint32_t*)(0x40033038UL))
#define FM0P_GPIO_PFRE                            *((volatile uint32_t*)(0x40033038UL))
#define FM_GPIO_PFRF                              *((volatile uint32_t*)(0x4003303CUL))
#define FM0P_GPIO_PFRF                            *((volatile uint32_t*)(0x4003303CUL))
#define FM_GPIO_PCR0                              *((volatile uint32_t*)(0x40033100UL))
#define FM0P_GPIO_PCR0                            *((volatile uint32_t*)(0x40033100UL))
#define FM_GPIO_PCR1                              *((volatile uint32_t*)(0x40033104UL))
#define FM0P_GPIO_PCR1                            *((volatile uint32_t*)(0x40033104UL))
#define FM_GPIO_PCR2                              *((volatile uint32_t*)(0x40033108UL))
#define FM0P_GPIO_PCR2                            *((volatile uint32_t*)(0x40033108UL))
#define FM_GPIO_PCR3                              *((volatile uint32_t*)(0x4003310CUL))
#define FM0P_GPIO_PCR3                            *((volatile uint32_t*)(0x4003310CUL))
#define FM_GPIO_PCR4                              *((volatile uint32_t*)(0x40033110UL))
#define FM0P_GPIO_PCR4                            *((volatile uint32_t*)(0x40033110UL))
#define FM_GPIO_PCR5                              *((volatile uint32_t*)(0x40033114UL))
#define FM0P_GPIO_PCR5                            *((volatile uint32_t*)(0x40033114UL))
#define FM_GPIO_PCR6                              *((volatile uint32_t*)(0x40033118UL))
#define FM0P_GPIO_PCR6                            *((volatile uint32_t*)(0x40033118UL))
#define FM_GPIO_PCR7                              *((volatile uint32_t*)(0x4003311CUL))
#define FM0P_GPIO_PCR7                            *((volatile uint32_t*)(0x4003311CUL))
#define FM_GPIO_PCR9                              *((volatile uint32_t*)(0x40033124UL))
#define FM0P_GPIO_PCR9                            *((volatile uint32_t*)(0x40033124UL))
#define FM_GPIO_PCRA                              *((volatile uint32_t*)(0x40033128UL))
#define FM0P_GPIO_PCRA                            *((volatile uint32_t*)(0x40033128UL))
#define FM_GPIO_PCRB                              *((volatile uint32_t*)(0x4003312CUL))
#define FM0P_GPIO_PCRB                            *((volatile uint32_t*)(0x4003312CUL))
#define FM_GPIO_PCRC                              *((volatile uint32_t*)(0x40033130UL))
#define FM0P_GPIO_PCRC                            *((volatile uint32_t*)(0x40033130UL))
#define FM_GPIO_PCRD                              *((volatile uint32_t*)(0x40033134UL))
#define FM0P_GPIO_PCRD                            *((volatile uint32_t*)(0x40033134UL))
#define FM_GPIO_PCRE                              *((volatile uint32_t*)(0x40033138UL))
#define FM0P_GPIO_PCRE                            *((volatile uint32_t*)(0x40033138UL))
#define FM_GPIO_PCRF                              *((volatile uint32_t*)(0x4003313CUL))
#define FM0P_GPIO_PCRF                            *((volatile uint32_t*)(0x4003313CUL))
#define FM_GPIO_DDR0                              *((volatile uint32_t*)(0x40033200UL))
#define FM0P_GPIO_DDR0                            *((volatile uint32_t*)(0x40033200UL))
#define FM_GPIO_DDR1                              *((volatile uint32_t*)(0x40033204UL))
#define FM0P_GPIO_DDR1                            *((volatile uint32_t*)(0x40033204UL))
#define FM_GPIO_DDR2                              *((volatile uint32_t*)(0x40033208UL))
#define FM0P_GPIO_DDR2                            *((volatile uint32_t*)(0x40033208UL))
#define FM_GPIO_DDR3                              *((volatile uint32_t*)(0x4003320CUL))
#define FM0P_GPIO_DDR3                            *((volatile uint32_t*)(0x4003320CUL))
#define FM_GPIO_DDR4                              *((volatile uint32_t*)(0x40033210UL))
#define FM0P_GPIO_DDR4                            *((volatile uint32_t*)(0x40033210UL))
#define FM_GPIO_DDR5                              *((volatile uint32_t*)(0x40033214UL))
#define FM0P_GPIO_DDR5                            *((volatile uint32_t*)(0x40033214UL))
#define FM_GPIO_DDR6                              *((volatile uint32_t*)(0x40033218UL))
#define FM0P_GPIO_DDR6                            *((volatile uint32_t*)(0x40033218UL))
#define FM_GPIO_DDR7                              *((volatile uint32_t*)(0x4003321CUL))
#define FM0P_GPIO_DDR7                            *((volatile uint32_t*)(0x4003321CUL))
#define FM_GPIO_DDR8                              *((volatile uint32_t*)(0x40033220UL))
#define FM0P_GPIO_DDR8                            *((volatile uint32_t*)(0x40033220UL))
#define FM_GPIO_DDR9                              *((volatile uint32_t*)(0x40033224UL))
#define FM0P_GPIO_DDR9                            *((volatile uint32_t*)(0x40033224UL))
#define FM_GPIO_DDRA                              *((volatile uint32_t*)(0x40033228UL))
#define FM0P_GPIO_DDRA                            *((volatile uint32_t*)(0x40033228UL))
#define FM_GPIO_DDRB                              *((volatile uint32_t*)(0x4003322CUL))
#define FM0P_GPIO_DDRB                            *((volatile uint32_t*)(0x4003322CUL))
#define FM_GPIO_DDRC                              *((volatile uint32_t*)(0x40033230UL))
#define FM0P_GPIO_DDRC                            *((volatile uint32_t*)(0x40033230UL))
#define FM_GPIO_DDRD                              *((volatile uint32_t*)(0x40033234UL))
#define FM0P_GPIO_DDRD                            *((volatile uint32_t*)(0x40033234UL))
#define FM_GPIO_DDRE                              *((volatile uint32_t*)(0x40033238UL))
#define FM0P_GPIO_DDRE                            *((volatile uint32_t*)(0x40033238UL))
#define FM_GPIO_DDRF                              *((volatile uint32_t*)(0x4003323CUL))
#define FM0P_GPIO_DDRF                            *((volatile uint32_t*)(0x4003323CUL))
#define FM_GPIO_PDIR0                             *((volatile uint32_t*)(0x40033300UL))
#define FM0P_GPIO_PDIR0                           *((volatile uint32_t*)(0x40033300UL))
#define FM_GPIO_PDIR1                             *((volatile uint32_t*)(0x40033304UL))
#define FM0P_GPIO_PDIR1                           *((volatile uint32_t*)(0x40033304UL))
#define FM_GPIO_PDIR2                             *((volatile uint32_t*)(0x40033308UL))
#define FM0P_GPIO_PDIR2                           *((volatile uint32_t*)(0x40033308UL))
#define FM_GPIO_PDIR3                             *((volatile uint32_t*)(0x4003330CUL))
#define FM0P_GPIO_PDIR3                           *((volatile uint32_t*)(0x4003330CUL))
#define FM_GPIO_PDIR4                             *((volatile uint32_t*)(0x40033310UL))
#define FM0P_GPIO_PDIR4                           *((volatile uint32_t*)(0x40033310UL))
#define FM_GPIO_PDIR5                             *((volatile uint32_t*)(0x40033314UL))
#define FM0P_GPIO_PDIR5                           *((volatile uint32_t*)(0x40033314UL))
#define FM_GPIO_PDIR6                             *((volatile uint32_t*)(0x40033318UL))
#define FM0P_GPIO_PDIR6                           *((volatile uint32_t*)(0x40033318UL))
#define FM_GPIO_PDIR7                             *((volatile uint32_t*)(0x4003331CUL))
#define FM0P_GPIO_PDIR7                           *((volatile uint32_t*)(0x4003331CUL))
#define FM_GPIO_PDIR8                             *((volatile uint32_t*)(0x40033320UL))
#define FM0P_GPIO_PDIR8                           *((volatile uint32_t*)(0x40033320UL))
#define FM_GPIO_PDIR9                             *((volatile uint32_t*)(0x40033324UL))
#define FM0P_GPIO_PDIR9                           *((volatile uint32_t*)(0x40033324UL))
#define FM_GPIO_PDIRA                             *((volatile uint32_t*)(0x40033328UL))
#define FM0P_GPIO_PDIRA                           *((volatile uint32_t*)(0x40033328UL))
#define FM_GPIO_PDIRB                             *((volatile uint32_t*)(0x4003332CUL))
#define FM0P_GPIO_PDIRB                           *((volatile uint32_t*)(0x4003332CUL))
#define FM_GPIO_PDIRC                             *((volatile uint32_t*)(0x40033330UL))
#define FM0P_GPIO_PDIRC                           *((volatile uint32_t*)(0x40033330UL))
#define FM_GPIO_PDIRD                             *((volatile uint32_t*)(0x40033334UL))
#define FM0P_GPIO_PDIRD                           *((volatile uint32_t*)(0x40033334UL))
#define FM_GPIO_PDIRE                             *((volatile uint32_t*)(0x40033338UL))
#define FM0P_GPIO_PDIRE                           *((volatile uint32_t*)(0x40033338UL))
#define FM_GPIO_PDIRF                             *((volatile uint32_t*)(0x4003333CUL))
#define FM0P_GPIO_PDIRF                           *((volatile uint32_t*)(0x4003333CUL))
#define FM_GPIO_PDOR0                             *((volatile uint32_t*)(0x40033400UL))
#define FM0P_GPIO_PDOR0                           *((volatile uint32_t*)(0x40033400UL))
#define FM_GPIO_PDOR1                             *((volatile uint32_t*)(0x40033404UL))
#define FM0P_GPIO_PDOR1                           *((volatile uint32_t*)(0x40033404UL))
#define FM_GPIO_PDOR2                             *((volatile uint32_t*)(0x40033408UL))
#define FM0P_GPIO_PDOR2                           *((volatile uint32_t*)(0x40033408UL))
#define FM_GPIO_PDOR3                             *((volatile uint32_t*)(0x4003340CUL))
#define FM0P_GPIO_PDOR3                           *((volatile uint32_t*)(0x4003340CUL))
#define FM_GPIO_PDOR4                             *((volatile uint32_t*)(0x40033410UL))
#define FM0P_GPIO_PDOR4                           *((volatile uint32_t*)(0x40033410UL))
#define FM_GPIO_PDOR5                             *((volatile uint32_t*)(0x40033414UL))
#define FM0P_GPIO_PDOR5                           *((volatile uint32_t*)(0x40033414UL))
#define FM_GPIO_PDOR6                             *((volatile uint32_t*)(0x40033418UL))
#define FM0P_GPIO_PDOR6                           *((volatile uint32_t*)(0x40033418UL))
#define FM_GPIO_PDOR7                             *((volatile uint32_t*)(0x4003341CUL))
#define FM0P_GPIO_PDOR7                           *((volatile uint32_t*)(0x4003341CUL))
#define FM_GPIO_PDOR8                             *((volatile uint32_t*)(0x40033420UL))
#define FM0P_GPIO_PDOR8                           *((volatile uint32_t*)(0x40033420UL))
#define FM_GPIO_PDOR9                             *((volatile uint32_t*)(0x40033424UL))
#define FM0P_GPIO_PDOR9                           *((volatile uint32_t*)(0x40033424UL))
#define FM_GPIO_PDORA                             *((volatile uint32_t*)(0x40033428UL))
#define FM0P_GPIO_PDORA                           *((volatile uint32_t*)(0x40033428UL))
#define FM_GPIO_PDORB                             *((volatile uint32_t*)(0x4003342CUL))
#define FM0P_GPIO_PDORB                           *((volatile uint32_t*)(0x4003342CUL))
#define FM_GPIO_PDORC                             *((volatile uint32_t*)(0x40033430UL))
#define FM0P_GPIO_PDORC                           *((volatile uint32_t*)(0x40033430UL))
#define FM_GPIO_PDORD                             *((volatile uint32_t*)(0x40033434UL))
#define FM0P_GPIO_PDORD                           *((volatile uint32_t*)(0x40033434UL))
#define FM_GPIO_PDORE                             *((volatile uint32_t*)(0x40033438UL))
#define FM0P_GPIO_PDORE                           *((volatile uint32_t*)(0x40033438UL))
#define FM_GPIO_PDORF                             *((volatile uint32_t*)(0x4003343CUL))
#define FM0P_GPIO_PDORF                           *((volatile uint32_t*)(0x4003343CUL))
#define FM_GPIO_ADE                               *((volatile uint32_t*)(0x40033500UL))
#define FM0P_GPIO_ADE                             *((volatile uint32_t*)(0x40033500UL))
#define FM_GPIO_SPSR                              *((volatile uint32_t*)(0x40033580UL))
#define FM0P_GPIO_SPSR                            *((volatile uint32_t*)(0x40033580UL))
#define FM_GPIO_EPFR00                            *((volatile uint32_t*)(0x40033600UL))
#define FM0P_GPIO_EPFR00                          *((volatile uint32_t*)(0x40033600UL))
#define FM_GPIO_EPFR01                            *((volatile uint32_t*)(0x40033604UL))
#define FM0P_GPIO_EPFR01                          *((volatile uint32_t*)(0x40033604UL))
#define FM_GPIO_EPFR04                            *((volatile uint32_t*)(0x40033610UL))
#define FM0P_GPIO_EPFR04                          *((volatile uint32_t*)(0x40033610UL))
#define FM_GPIO_EPFR05                            *((volatile uint32_t*)(0x40033614UL))
#define FM0P_GPIO_EPFR05                          *((volatile uint32_t*)(0x40033614UL))
#define FM_GPIO_EPFR06                            *((volatile uint32_t*)(0x40033618UL))
#define FM0P_GPIO_EPFR06                          *((volatile uint32_t*)(0x40033618UL))
#define FM_GPIO_EPFR07                            *((volatile uint32_t*)(0x4003361CUL))
#define FM0P_GPIO_EPFR07                          *((volatile uint32_t*)(0x4003361CUL))
#define FM_GPIO_EPFR08                            *((volatile uint32_t*)(0x40033620UL))
#define FM0P_GPIO_EPFR08                          *((volatile uint32_t*)(0x40033620UL))
#define FM_GPIO_EPFR09                            *((volatile uint32_t*)(0x40033624UL))
#define FM0P_GPIO_EPFR09                          *((volatile uint32_t*)(0x40033624UL))
#define FM_GPIO_EPFR15                            *((volatile uint32_t*)(0x4003363CUL))
#define FM0P_GPIO_EPFR15                          *((volatile uint32_t*)(0x4003363CUL))
#define FM_GPIO_EPFR16                            *((volatile uint32_t*)(0x40033640UL))
#define FM0P_GPIO_EPFR16                          *((volatile uint32_t*)(0x40033640UL))
#define FM_GPIO_EPFR18                            *((volatile uint32_t*)(0x40033648UL))
#define FM0P_GPIO_EPFR18                          *((volatile uint32_t*)(0x40033648UL))
#define FM_GPIO_EPFR23                            *((volatile uint32_t*)(0x4003365CUL))
#define FM0P_GPIO_EPFR23                          *((volatile uint32_t*)(0x4003365CUL))
#define FM_GPIO_EPFR33                            *((volatile uint32_t*)(0x40033684UL))
#define FM0P_GPIO_EPFR33                          *((volatile uint32_t*)(0x40033684UL))
#define FM_GPIO_EPFR34                            *((volatile uint32_t*)(0x40033688UL))
#define FM0P_GPIO_EPFR34                          *((volatile uint32_t*)(0x40033688UL))
#define FM_GPIO_EPFR37                            *((volatile uint32_t*)(0x40033694UL))
#define FM0P_GPIO_EPFR37                          *((volatile uint32_t*)(0x40033694UL))
#define FM_GPIO_EPFR38                            *((volatile uint32_t*)(0x40033698UL))
#define FM0P_GPIO_EPFR38                          *((volatile uint32_t*)(0x40033698UL))
#define FM_GPIO_PZR0                              *((volatile uint32_t*)(0x40033700UL))
#define FM0P_GPIO_PZR0                            *((volatile uint32_t*)(0x40033700UL))
#define FM_GPIO_PZR1                              *((volatile uint32_t*)(0x40033704UL))
#define FM0P_GPIO_PZR1                            *((volatile uint32_t*)(0x40033704UL))
#define FM_GPIO_PZR2                              *((volatile uint32_t*)(0x40033708UL))
#define FM0P_GPIO_PZR2                            *((volatile uint32_t*)(0x40033708UL))
#define FM_GPIO_PZR3                              *((volatile uint32_t*)(0x4003370CUL))
#define FM0P_GPIO_PZR3                            *((volatile uint32_t*)(0x4003370CUL))
#define FM_GPIO_PZR4                              *((volatile uint32_t*)(0x40033710UL))
#define FM0P_GPIO_PZR4                            *((volatile uint32_t*)(0x40033710UL))
#define FM_GPIO_PZR5                              *((volatile uint32_t*)(0x40033714UL))
#define FM0P_GPIO_PZR5                            *((volatile uint32_t*)(0x40033714UL))
#define FM_GPIO_PZR6                              *((volatile uint32_t*)(0x40033718UL))
#define FM0P_GPIO_PZR6                            *((volatile uint32_t*)(0x40033718UL))
#define FM_GPIO_PZR7                              *((volatile uint32_t*)(0x4003371CUL))
#define FM0P_GPIO_PZR7                            *((volatile uint32_t*)(0x4003371CUL))
#define FM_GPIO_PZR8                              *((volatile uint32_t*)(0x40033720UL))
#define FM0P_GPIO_PZR8                            *((volatile uint32_t*)(0x40033720UL))
#define FM_GPIO_PZR9                              *((volatile uint32_t*)(0x40033724UL))
#define FM0P_GPIO_PZR9                            *((volatile uint32_t*)(0x40033724UL))
#define FM_GPIO_PZRA                              *((volatile uint32_t*)(0x40033728UL))
#define FM0P_GPIO_PZRA                            *((volatile uint32_t*)(0x40033728UL))
#define FM_GPIO_PZRB                              *((volatile uint32_t*)(0x4003372CUL))
#define FM0P_GPIO_PZRB                            *((volatile uint32_t*)(0x4003372CUL))
#define FM_GPIO_PZRC                              *((volatile uint32_t*)(0x40033730UL))
#define FM0P_GPIO_PZRC                            *((volatile uint32_t*)(0x40033730UL))
#define FM_GPIO_PZRD                              *((volatile uint32_t*)(0x40033734UL))
#define FM0P_GPIO_PZRD                            *((volatile uint32_t*)(0x40033734UL))
#define FM_GPIO_PZRE                              *((volatile uint32_t*)(0x40033738UL))
#define FM0P_GPIO_PZRE                            *((volatile uint32_t*)(0x40033738UL))
#define FM_GPIO_PZRF                              *((volatile uint32_t*)(0x4003373CUL))
#define FM0P_GPIO_PZRF                            *((volatile uint32_t*)(0x4003373CUL))
#define FM_GPIO_LVDIE                             *((volatile uint32_t*)(0x40033740UL))
#define FM0P_GPIO_LVDIE                           *((volatile uint32_t*)(0x40033740UL))
#define FM_GPIO_FPOER0                            *((volatile uint32_t*)(0x40033900UL))
#define FM0P_GPIO_FPOER0                          *((volatile uint32_t*)(0x40033900UL))
#define FM_GPIO_FPOER1                            *((volatile uint32_t*)(0x40033904UL))
#define FM0P_GPIO_FPOER1                          *((volatile uint32_t*)(0x40033904UL))
#define FM_GPIO_FPOER2                            *((volatile uint32_t*)(0x40033908UL))
#define FM0P_GPIO_FPOER2                          *((volatile uint32_t*)(0x40033908UL))
#define FM_GPIO_FPOER3                            *((volatile uint32_t*)(0x4003390CUL))
#define FM0P_GPIO_FPOER3                          *((volatile uint32_t*)(0x4003390CUL))
#define FM_GPIO_FPOER4                            *((volatile uint32_t*)(0x40033910UL))
#define FM0P_GPIO_FPOER4                          *((volatile uint32_t*)(0x40033910UL))
#define FM_GPIO_FPOER5                            *((volatile uint32_t*)(0x40033914UL))
#define FM0P_GPIO_FPOER5                          *((volatile uint32_t*)(0x40033914UL))
#define FM_GPIO_FPOER6                            *((volatile uint32_t*)(0x40033918UL))
#define FM0P_GPIO_FPOER6                          *((volatile uint32_t*)(0x40033918UL))
#define FM_GPIO_FPOER7                            *((volatile uint32_t*)(0x4003391CUL))
#define FM0P_GPIO_FPOER7                          *((volatile uint32_t*)(0x4003391CUL))
#define FM_GPIO_FPOER8                            *((volatile uint32_t*)(0x40033920UL))
#define FM0P_GPIO_FPOER8                          *((volatile uint32_t*)(0x40033920UL))
#define FM_GPIO_FPOER9                            *((volatile uint32_t*)(0x40033924UL))
#define FM0P_GPIO_FPOER9                          *((volatile uint32_t*)(0x40033924UL))
