mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xe/common/s6e1b8xe.h
/*******************************************************************************
* LCDC Registers LCDC
*   Register Definition
*******************************************************************************/
#define FM_LCDC_LCDCC1                            *((volatile  uint8_t*)(0x40032000UL))
#define FM0P_LCDC_LCDCC1                          *((volatile  uint8_t*)(0x40032000UL))
#define FM_LCDC_LCDCC2                            *((volatile  uint8_t*)(0x40032001UL))
#define FM0P_LCDC_LCDCC2                          *((volatile  uint8_t*)(0x40032001UL))
#define FM_LCDC_LCDCC3                            *((volatile  uint8_t*)(0x40032002UL))
#define FM0P_LCDC_LCDCC3                          *((volatile  uint8_t*)(0x40032002UL))
#define FM_LCDC_LCDC_PSR                          *((volatile uint32_t*)(0x40032004UL))
#define FM0P_LCDC_LCDC_PSR                        *((volatile uint32_t*)(0x40032004UL))
#define FM_LCDC_LCDC_COMEN                        *((volatile  uint8_t*)(0x40032008UL))
#define FM0P_LCDC_LCDC_COMEN                      *((volatile  uint8_t*)(0x40032008UL))
#define FM_LCDC_LCDC_SEGEN1                       *((volatile uint32_t*)(0x4003200CUL))
#define FM0P_LCDC_LCDC_SEGEN1                     *((volatile uint32_t*)(0x4003200CUL))
#define FM_LCDC_LCDC_SEGEN2                       *((volatile  uint8_t*)(0x40032010UL))
#define FM0P_LCDC_LCDC_SEGEN2                     *((volatile  uint8_t*)(0x40032010UL))
#define FM_LCDC_LCDC_BLINK                        *((volatile uint16_t*)(0x40032014UL))
#define FM0P_LCDC_LCDC_BLINK                      *((volatile uint16_t*)(0x40032014UL))
#define FM_LCDC_LCDC_BOOSTER                      *((volatile uint16_t*)(0x40032018UL))
#define FM0P_LCDC_LCDC_BOOSTER                    *((volatile uint16_t*)(0x40032018UL))
#define FM_LCDC_LCDRAM00                          *((volatile  uint8_t*)(0x4003201CUL))
#define FM0P_LCDC_LCDRAM00                        *((volatile  uint8_t*)(0x4003201CUL))
#define FM_LCDC_LCDRAM01                          *((volatile  uint8_t*)(0x4003201DUL))
#define FM0P_LCDC_LCDRAM01                        *((volatile  uint8_t*)(0x4003201DUL))
#define FM_LCDC_LCDRAM02                          *((volatile  uint8_t*)(0x4003201EUL))
#define FM0P_LCDC_LCDRAM02                        *((volatile  uint8_t*)(0x4003201EUL))
#define FM_LCDC_LCDRAM03                          *((volatile  uint8_t*)(0x4003201FUL))
#define FM0P_LCDC_LCDRAM03                        *((volatile  uint8_t*)(0x4003201FUL))
#define FM_LCDC_LCDRAM04                          *((volatile  uint8_t*)(0x40032020UL))
#define FM0P_LCDC_LCDRAM04                        *((volatile  uint8_t*)(0x40032020UL))
#define FM_LCDC_LCDRAM05                          *((volatile  uint8_t*)(0x40032021UL))
#define FM0P_LCDC_LCDRAM05                        *((volatile  uint8_t*)(0x40032021UL))
#define FM_LCDC_LCDRAM06                          *((volatile  uint8_t*)(0x40032022UL))
#define FM0P_LCDC_LCDRAM06                        *((volatile  uint8_t*)(0x40032022UL))
#define FM_LCDC_LCDRAM07                          *((volatile  uint8_t*)(0x40032023UL))
#define FM0P_LCDC_LCDRAM07                        *((volatile  uint8_t*)(0x40032023UL))
#define FM_LCDC_LCDRAM08                          *((volatile  uint8_t*)(0x40032024UL))
#define FM0P_LCDC_LCDRAM08                        *((volatile  uint8_t*)(0x40032024UL))
#define FM_LCDC_LCDRAM09                          *((volatile  uint8_t*)(0x40032025UL))
#define FM0P_LCDC_LCDRAM09                        *((volatile  uint8_t*)(0x40032025UL))
#define FM_LCDC_LCDRAM10                          *((volatile  uint8_t*)(0x40032026UL))
#define FM0P_LCDC_LCDRAM10                        *((volatile  uint8_t*)(0x40032026UL))
#define FM_LCDC_LCDRAM11                          *((volatile  uint8_t*)(0x40032027UL))
#define FM0P_LCDC_LCDRAM11                        *((volatile  uint8_t*)(0x40032027UL))
#define FM_LCDC_LCDRAM12                          *((volatile  uint8_t*)(0x40032028UL))
#define FM0P_LCDC_LCDRAM12                        *((volatile  uint8_t*)(0x40032028UL))
#define FM_LCDC_LCDRAM13                          *((volatile  uint8_t*)(0x40032029UL))
#define FM0P_LCDC_LCDRAM13                        *((volatile  uint8_t*)(0x40032029UL))
#define FM_LCDC_LCDRAM14                          *((volatile  uint8_t*)(0x4003202AUL))
#define FM0P_LCDC_LCDRAM14                        *((volatile  uint8_t*)(0x4003202AUL))
#define FM_LCDC_LCDRAM15                          *((volatile  uint8_t*)(0x4003202BUL))
#define FM0P_LCDC_LCDRAM15                        *((volatile  uint8_t*)(0x4003202BUL))
#define FM_LCDC_LCDRAM16                          *((volatile  uint8_t*)(0x4003202CUL))
#define FM0P_LCDC_LCDRAM16                        *((volatile  uint8_t*)(0x4003202CUL))
#define FM_LCDC_LCDRAM17                          *((volatile  uint8_t*)(0x4003202DUL))
#define FM0P_LCDC_LCDRAM17                        *((volatile  uint8_t*)(0x4003202DUL))
#define FM_LCDC_LCDRAM18                          *((volatile  uint8_t*)(0x4003202EUL))
#define FM0P_LCDC_LCDRAM18                        *((volatile  uint8_t*)(0x4003202EUL))
#define FM_LCDC_LCDRAM19                          *((volatile  uint8_t*)(0x4003202FUL))
#define FM0P_LCDC_LCDRAM19                        *((volatile  uint8_t*)(0x4003202FUL))
#define FM_LCDC_LCDRAM20                          *((volatile  uint8_t*)(0x40032030UL))
#define FM0P_LCDC_LCDRAM20                        *((volatile  uint8_t*)(0x40032030UL))
#define FM_LCDC_LCDRAM21                          *((volatile  uint8_t*)(0x40032031UL))
#define FM0P_LCDC_LCDRAM21                        *((volatile  uint8_t*)(0x40032031UL))
#define FM_LCDC_LCDRAM22                          *((volatile  uint8_t*)(0x40032032UL))
#define FM0P_LCDC_LCDRAM22                        *((volatile  uint8_t*)(0x40032032UL))
#define FM_LCDC_LCDRAM23                          *((volatile  uint8_t*)(0x40032033UL))
#define FM0P_LCDC_LCDRAM23                        *((volatile  uint8_t*)(0x40032033UL))
#define FM_LCDC_LCDRAM24                          *((volatile  uint8_t*)(0x40032034UL))
#define FM0P_LCDC_LCDRAM24                        *((volatile  uint8_t*)(0x40032034UL))
#define FM_LCDC_LCDRAM25                          *((volatile  uint8_t*)(0x40032035UL))
#define FM0P_LCDC_LCDRAM25                        *((volatile  uint8_t*)(0x40032035UL))
#define FM_LCDC_LCDRAM26                          *((volatile  uint8_t*)(0x40032036UL))
#define FM0P_LCDC_LCDRAM26                        *((volatile  uint8_t*)(0x40032036UL))
#define FM_LCDC_LCDRAM27                          *((volatile  uint8_t*)(0x40032037UL))
#define FM0P_LCDC_LCDRAM27                        *((volatile  uint8_t*)(0x40032037UL))
#define FM_LCDC_LCDRAM28                          *((volatile  uint8_t*)(0x40032038UL))
#define FM0P_LCDC_LCDRAM28                        *((volatile  uint8_t*)(0x40032038UL))
#define FM_LCDC_LCDRAM29                          *((volatile  uint8_t*)(0x40032039UL))
#define FM0P_LCDC_LCDRAM29                        *((volatile  uint8_t*)(0x40032039UL))
#define FM_LCDC_LCDRAM30                          *((volatile  uint8_t*)(0x4003203AUL))
#define FM0P_LCDC_LCDRAM30                        *((volatile  uint8_t*)(0x4003203AUL))
#define FM_LCDC_LCDRAM31                          *((volatile  uint8_t*)(0x4003203BUL))
#define FM0P_LCDC_LCDRAM31                        *((volatile  uint8_t*)(0x4003203BUL))
#define FM_LCDC_LCDRAM32                          *((volatile  uint8_t*)(0x4003203CUL))
#define FM0P_LCDC_LCDRAM32                        *((volatile  uint8_t*)(0x4003203CUL))
#define FM_LCDC_LCDRAM33                          *((volatile  uint8_t*)(0x4003203DUL))
#define FM0P_LCDC_LCDRAM33                        *((volatile  uint8_t*)(0x4003203DUL))
#define FM_LCDC_LCDRAM34                          *((volatile  uint8_t*)(0x4003203EUL))
#define FM0P_LCDC_LCDRAM34                        *((volatile  uint8_t*)(0x4003203EUL))
#define FM_LCDC_LCDRAM35                          *((volatile  uint8_t*)(0x4003203FUL))
#define FM0P_LCDC_LCDRAM35                        *((volatile  uint8_t*)(0x4003203FUL))
#define FM_LCDC_LCDRAM36                          *((volatile  uint8_t*)(0x40032040UL))
#define FM0P_LCDC_LCDRAM36                        *((volatile  uint8_t*)(0x40032040UL))
#define FM_LCDC_LCDRAM37                          *((volatile  uint8_t*)(0x40032041UL))
#define FM0P_LCDC_LCDRAM37                        *((volatile  uint8_t*)(0x40032041UL))
#define FM_LCDC_LCDRAM38                          *((volatile  uint8_t*)(0x40032042UL))
#define FM0P_LCDC_LCDRAM38                        *((volatile  uint8_t*)(0x40032042UL))
#define FM_LCDC_LCDRAM39                          *((volatile  uint8_t*)(0x40032043UL))
#define FM0P_LCDC_LCDRAM39                        *((volatile  uint8_t*)(0x40032043UL))

