mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xe/common/s6e1b8xe.h
/*******************************************************************************
* USBCLK Registers USBCLK
*   Register Definition
*******************************************************************************/
#define FM_USBCLK_UCCR                            *((volatile  uint8_t*)(0x40036000UL))
#define FM0P_USBCLK_UCCR                          *((volatile  uint8_t*)(0x40036000UL))
#define FM_USBCLK_UPCR1                           *((volatile  uint8_t*)(0x40036004UL))
#define FM0P_USBCLK_UPCR1                         *((volatile  uint8_t*)(0x40036004UL))
#define FM_USBCLK_UPCR2                           *((volatile  uint8_t*)(0x40036008UL))
#define FM0P_USBCLK_UPCR2                         *((volatile  uint8_t*)(0x40036008UL))
#define FM_USBCLK_UPCR3                           *((volatile  uint8_t*)(0x4003600CUL))
#define FM0P_USBCLK_UPCR3                         *((volatile  uint8_t*)(0x4003600CUL))
#define FM_USBCLK_UPCR4                           *((volatile  uint8_t*)(0x40036010UL))
#define FM0P_USBCLK_UPCR4                         *((volatile  uint8_t*)(0x40036010UL))
#define FM_USBCLK_UP_STR                          *((volatile  uint8_t*)(0x40036014UL))
#define FM0P_USBCLK_UP_STR                        *((volatile  uint8_t*)(0x40036014UL))
#define FM_USBCLK_UPINT_ENR                       *((volatile  uint8_t*)(0x40036018UL))
#define FM0P_USBCLK_UPINT_ENR                     *((volatile  uint8_t*)(0x40036018UL))
#define FM_USBCLK_UPINT_CLR                       *((volatile  uint8_t*)(0x4003601CUL))
#define FM0P_USBCLK_UPINT_CLR                     *((volatile  uint8_t*)(0x4003601CUL))
#define FM_USBCLK_UPINT_STR                       *((volatile  uint8_t*)(0x40036020UL))
#define FM0P_USBCLK_UPINT_STR                     *((volatile  uint8_t*)(0x40036020UL))
#define FM_USBCLK_UPCR5                           *((volatile  uint8_t*)(0x40036024UL))
#define FM0P_USBCLK_UPCR5                         *((volatile  uint8_t*)(0x40036024UL))
#define FM_USBCLK_USBEN0                          *((volatile  uint8_t*)(0x40036030UL))
#define FM0P_USBCLK_USBEN0                        *((volatile  uint8_t*)(0x40036030UL))
#define FM_USBCLK_USBEN1                          *((volatile  uint8_t*)(0x40036034UL))
#define FM0P_USBCLK_USBEN1                        *((volatile  uint8_t*)(0x40036034UL))

/*******************************************************************************
* WC Registers WC
*   Register Definition
*******************************************************************************/
#define FM_WC_WCRD                                *((volatile  uint8_t*)(0x4003A000UL))
#define FM0P_WC_WCRD                              *((volatile  uint8_t*)(0x4003A000UL))
#define FM_WC_WCRL                                *((volatile  uint8_t*)(0x4003A001UL))
#define FM0P_WC_WCRL                              *((volatile  uint8_t*)(0x4003A001UL))
#define FM_WC_WCCR                                *((volatile  uint8_t*)(0x4003A002UL))
#define FM0P_WC_WCCR                              *((volatile  uint8_t*)(0x4003A002UL))
#define FM_WC_CLK_SEL                             *((volatile uint16_t*)(0x4003A010UL))
#define FM0P_WC_CLK_SEL                           *((volatile uint16_t*)(0x4003A010UL))
#define FM_WC_CLK_EN                              *((volatile  uint8_t*)(0x4003A014UL))
#define FM0P_WC_CLK_EN                            *((volatile  uint8_t*)(0x4003A014UL))

/*******************************************************************************
* Available Registers
*******************************************************************************/
/*******************************************************************************
* ADC0
*******************************************************************************/
#define FM0P_ADC_ADCEN_AVAILABLE                  1
#define FM_ADC_ADCEN_AVAILABLE                    1
#define FM0P_ADC_ADCR_AVAILABLE                   1
#define FM_ADC_ADCR_AVAILABLE                     1
#define FM0P_ADC_ADCT_AVAILABLE                   1
#define FM_ADC_ADCT_AVAILABLE                     1
#define FM0P_ADC_ADSR_AVAILABLE                   1
#define FM_ADC_ADSR_AVAILABLE                     1
#define FM0P_ADC_ADSS01_AVAILABLE                 1
#define FM_ADC_ADSS01_AVAILABLE                   1
#define FM0P_ADC_ADSS23_AVAILABLE                 1
#define FM_ADC_ADSS23_AVAILABLE                   1
#define FM0P_ADC_ADST01_AVAILABLE                 1
#define FM_ADC_ADST01_AVAILABLE                   1
#define FM0P_ADC_CMPCR_AVAILABLE                  1
#define FM_ADC_CMPCR_AVAILABLE                    1
#define FM0P_ADC_CMPD_AVAILABLE                   1
#define FM_ADC_CMPD_AVAILABLE                     1
#define FM0P_ADC_PCCR_AVAILABLE                   1
#define FM_ADC_PCCR_AVAILABLE                     1
#define FM0P_ADC_PCFD_AVAILABLE                   1
#define FM_ADC_PCFD_AVAILABLE                     1
#define FM0P_ADC_PCFD_FDAS1_AVAILABLE             1
#define FM_ADC_PCFD_FDAS1_AVAILABLE               1
#define FM0P_ADC_PCIS_AVAILABLE                   1
#define FM_ADC_PCIS_AVAILABLE                     1
#define FM0P_ADC_PFNS_AVAILABLE                   1
#define FM_ADC_PFNS_AVAILABLE                     1
#define FM0P_ADC_PRTSL_AVAILABLE                  1
#define FM_ADC_PRTSL_AVAILABLE                    1
#define FM0P_ADC_SCCR_AVAILABLE                   1
#define FM_ADC_SCCR_AVAILABLE                     1
#define FM0P_ADC_SCFD_AVAILABLE                   1
#define FM_ADC_SCFD_AVAILABLE                     1
#define FM0P_ADC_SCFD_FDAS1_AVAILABLE             1
#define FM_ADC_SCFD_FDAS1_AVAILABLE               1
#define FM0P_ADC_SCIS01_AVAILABLE                 1
#define FM_ADC_SCIS01_AVAILABLE                   1
#define FM0P_ADC_SCIS23_AVAILABLE                 1
#define FM_ADC_SCIS23_AVAILABLE                   1
#define FM0P_ADC_SCTSL_AVAILABLE                  1
#define FM_ADC_SCTSL_AVAILABLE                    1
#define FM0P_ADC_SFNS_AVAILABLE                   1
#define FM_ADC_SFNS_AVAILABLE                     1
#define FM0P_ADC_WCMPCR_AVAILABLE                 1
#define FM_ADC_WCMPCR_AVAILABLE                   1
#define FM0P_ADC_WCMPDH_AVAILABLE                 1
#define FM_ADC_WCMPDH_AVAILABLE                   1
#define FM0P_ADC_WCMPDL_AVAILABLE                 1
#define FM_ADC_WCMPDL_AVAILABLE                   1
#define FM0P_ADC_WCMPSR_AVAILABLE                 1
#define FM_ADC_WCMPSR_AVAILABLE                   1
#define FM0P_ADC_WCMRCIF_AVAILABLE                1
#define FM_ADC_WCMRCIF_AVAILABLE                  1
#define FM0P_ADC_WCMRCOT_AVAILABLE                1
#define FM_ADC_WCMRCOT_AVAILABLE                  1
/*******************************************************************************
* BT0
*******************************************************************************/
#define FM0P_BT_PPG_PRLH_AVAILABLE                1
#define FM_BT_PPG_PRLH_AVAILABLE                  1
#define FM0P_BT_PPG_PRLL_AVAILABLE                1
#define FM_BT_PPG_PRLL_AVAILABLE                  1
#define FM0P_BT_PPG_STC_AVAILABLE                 1
#define FM_BT_PPG_STC_AVAILABLE                   1
#define FM0P_BT_PPG_TMCR_AVAILABLE                1
#define FM_BT_PPG_TMCR_AVAILABLE                  1
#define FM0P_BT_PPG_TMCR2_AVAILABLE               1
#define FM_BT_PPG_TMCR2_AVAILABLE                 1
#define FM0P_BT_PPG_TMR_AVAILABLE                 1
#define FM_BT_PPG_TMR_AVAILABLE                   1
#define FM0P_BT_PWC_DTBF_AVAILABLE                1
#define FM_BT_PWC_DTBF_AVAILABLE                  1
#define FM0P_BT_PWC_STC_AVAILABLE                 1
#define FM_BT_PWC_STC_AVAILABLE                   1
#define FM0P_BT_PWC_TMCR_AVAILABLE                1
#define FM_BT_PWC_TMCR_AVAILABLE                  1
#define FM0P_BT_PWC_TMCR2_AVAILABLE               1
#define FM_BT_PWC_TMCR2_AVAILABLE                 1
#define FM0P_BT_PWM_PCSR_AVAILABLE                1
#define FM_BT_PWM_PCSR_AVAILABLE                  1
#define FM0P_BT_PWM_PDUT_AVAILABLE                1
#define FM_BT_PWM_PDUT_AVAILABLE                  1
#define FM0P_BT_PWM_STC_AVAILABLE                 1
#define FM_BT_PWM_STC_AVAILABLE                   1
#define FM0P_BT_PWM_TMCR_AVAILABLE                1
#define FM_BT_PWM_TMCR_AVAILABLE                  1
#define FM0P_BT_PWM_TMCR2_AVAILABLE               1
#define FM_BT_PWM_TMCR2_AVAILABLE                 1
#define FM0P_BT_PWM_TMR_AVAILABLE                 1
#define FM_BT_PWM_TMR_AVAILABLE                   1
#define FM0P_BT_RT_PCSR_AVAILABLE                 1
#define FM_BT_RT_PCSR_AVAILABLE                   1
#define FM0P_BT_RT_STC_AVAILABLE                  1
#define FM_BT_RT_STC_AVAILABLE                    1
#define FM0P_BT_RT_TMCR_AVAILABLE                 1
#define FM_BT_RT_TMCR_AVAILABLE                   1
#define FM0P_BT_RT_TMCR2_AVAILABLE                1
#define FM_BT_RT_TMCR2_AVAILABLE                  1
#define FM0P_BT_RT_TMR_AVAILABLE                  1
#define FM_BT_RT_TMR_AVAILABLE                    1
/*******************************************************************************
* BTIOSEL03
*******************************************************************************/
#define FM0P_BTIOSEL03_BTSEL0123_AVAILABLE        1
#define FM_BTIOSEL03_BTSEL0123_AVAILABLE          1
/*******************************************************************************
* BTIOSEL47
*******************************************************************************/
#define FM0P_BTIOSEL47_BTSEL4567_AVAILABLE        1
#define FM_BTIOSEL47_BTSEL4567_AVAILABLE          1
/*******************************************************************************
* CLK_GATING
*******************************************************************************/
#define FM0P_CLK_GATING_CKEN0_AVAILABLE           1
#define FM_CLK_GATING_CKEN0_AVAILABLE             1
#define FM0P_CLK_GATING_CKEN1_AVAILABLE           1
#define FM_CLK_GATING_CKEN1_AVAILABLE             1
#define FM0P_CLK_GATING_CKEN2_AVAILABLE           1
#define FM_CLK_GATING_CKEN2_AVAILABLE             1
#define FM0P_CLK_GATING_MRST0_AVAILABLE           1
#define FM_CLK_GATING_MRST0_AVAILABLE             1
#define FM0P_CLK_GATING_MRST1_AVAILABLE           1
#define FM_CLK_GATING_MRST1_AVAILABLE             1
#define FM0P_CLK_GATING_MRST2_AVAILABLE           1
#define FM_CLK_GATING_MRST2_AVAILABLE             1
/*******************************************************************************
* CRC
*******************************************************************************/
#define FM0P_CRC_CRCCR_AVAILABLE                  1
#define FM_CRC_CRCCR_AVAILABLE                    1
#define FM0P_CRC_CRCIN_AVAILABLE                  1
#define FM_CRC_CRCIN_AVAILABLE                    1
#define FM0P_CRC_CRCINIT_AVAILABLE                1
#define FM_CRC_CRCINIT_AVAILABLE                  1
#define FM0P_CRC_CRCR_AVAILABLE                   1
#define FM_CRC_CRCR_AVAILABLE                     1
/*******************************************************************************
* CRG
*******************************************************************************/
#define FM0P_CRG_APBC0_PSR_AVAILABLE              1
#define FM_CRG_APBC0_PSR_AVAILABLE                1
#define FM0P_CRG_APBC1_PSR_AVAILABLE              1
#define FM_CRG_APBC1_PSR_AVAILABLE                1
#define FM0P_CRG_BSC_PSR_AVAILABLE                1
#define FM_CRG_BSC_PSR_AVAILABLE                  1
#define FM0P_CRG_CSV_CTL_AVAILABLE                1
#define FM_CRG_CSV_CTL_AVAILABLE                  1
#define FM0P_CRG_CSV_STR_AVAILABLE                1
#define FM_CRG_CSV_STR_AVAILABLE                  1
#define FM0P_CRG_CSW_TMR_AVAILABLE                1
#define FM_CRG_CSW_TMR_AVAILABLE                  1
#define FM0P_CRG_DBWDT_CTL_AVAILABLE              1
#define FM_CRG_DBWDT_CTL_AVAILABLE                1
#define FM0P_CRG_FCSWD_CTL_AVAILABLE              1
#define FM_CRG_FCSWD_CTL_AVAILABLE                1
#define FM0P_CRG_FCSWH_CTL_AVAILABLE              1
#define FM_CRG_FCSWH_CTL_AVAILABLE                1
#define FM0P_CRG_FCSWL_CTL_AVAILABLE              1
#define FM_CRG_FCSWL_CTL_AVAILABLE                1
#define FM0P_CRG_INT_CLR_AVAILABLE                1
#define FM_CRG_INT_CLR_AVAILABLE                  1
#define FM0P_CRG_INT_ENR_AVAILABLE                1
#define FM_CRG_INT_ENR_AVAILABLE                  1
#define FM0P_CRG_INT_STR_AVAILABLE                1
#define FM_CRG_INT_STR_AVAILABLE                  1
#define FM0P_CRG_PLL_CTL1_AVAILABLE               1
#define FM_CRG_PLL_CTL1_AVAILABLE                 1
#define FM0P_CRG_PLL_CTL2_AVAILABLE               1
#define FM_CRG_PLL_CTL2_AVAILABLE                 1
#define FM0P_CRG_PSW_TMR_AVAILABLE                1
#define FM_CRG_PSW_TMR_AVAILABLE                  1
#define FM0P_CRG_RST_STR_AVAILABLE                1
#define FM_CRG_RST_STR_AVAILABLE                  1
#define FM0P_CRG_SCM_CTL_AVAILABLE                1
#define FM_CRG_SCM_CTL_AVAILABLE                  1
#define FM0P_CRG_SCM_STR_AVAILABLE                1
#define FM_CRG_SCM_STR_AVAILABLE                  1
#define FM0P_CRG_STB_CTL_AVAILABLE                1
#define FM_CRG_STB_CTL_AVAILABLE                  1
#define FM0P_CRG_SWC_PSR_AVAILABLE                1
#define FM_CRG_SWC_PSR_AVAILABLE                  1
/*******************************************************************************
* CRTRIM
*******************************************************************************/
#define FM0P_CRTRIM_MCR_FTRM_AVAILABLE            1
#define FM_CRTRIM_MCR_FTRM_AVAILABLE              1
#define FM0P_CRTRIM_MCR_PSR_AVAILABLE             1
#define FM_CRTRIM_MCR_PSR_AVAILABLE               1
#define FM0P_CRTRIM_MCR_RLR_AVAILABLE             1
#define FM_CRTRIM_MCR_RLR_AVAILABLE               1
#define FM0P_CRTRIM_MCR_TTRM_AVAILABLE            1
#define FM_CRTRIM_MCR_TTRM_AVAILABLE              1
/*******************************************************************************
* DS
*******************************************************************************/
#define FM0P_DS_BUR01_AVAILABLE                   1
#define FM_DS_BUR01_AVAILABLE                     1
#define FM0P_DS_BUR02_AVAILABLE                   1
#define FM_DS_BUR02_AVAILABLE                     1
#define FM0P_DS_BUR03_AVAILABLE                   1
#define FM_DS_BUR03_AVAILABLE                     1
#define FM0P_DS_BUR04_AVAILABLE                   1
#define FM_DS_BUR04_AVAILABLE                     1
#define FM0P_DS_BUR05_AVAILABLE                   1
#define FM_DS_BUR05_AVAILABLE                     1
#define FM0P_DS_BUR06_AVAILABLE                   1
#define FM_DS_BUR06_AVAILABLE                     1
#define FM0P_DS_BUR07_AVAILABLE                   1
#define FM_DS_BUR07_AVAILABLE                     1
#define FM0P_DS_BUR08_AVAILABLE                   1
#define FM_DS_BUR08_AVAILABLE                     1
#define FM0P_DS_BUR09_AVAILABLE                   1
#define FM_DS_BUR09_AVAILABLE                     1
#define FM0P_DS_BUR10_AVAILABLE                   1
#define FM_DS_BUR10_AVAILABLE                     1
#define FM0P_DS_BUR11_AVAILABLE                   1
#define FM_DS_BUR11_AVAILABLE                     1
#define FM0P_DS_BUR12_AVAILABLE                   1
#define FM_DS_BUR12_AVAILABLE                     1
#define FM0P_DS_BUR13_AVAILABLE                   1
#define FM_DS_BUR13_AVAILABLE                     1
#define FM0P_DS_BUR14_AVAILABLE                   1
#define FM_DS_BUR14_AVAILABLE                     1
#define FM0P_DS_BUR15_AVAILABLE                   1
#define FM_DS_BUR15_AVAILABLE                     1
#define FM0P_DS_BUR16_AVAILABLE                   1
#define FM_DS_BUR16_AVAILABLE                     1
#define FM0P_DS_CAL_CTL_AVAILABLE                 1
#define FM_DS_CAL_CTL_AVAILABLE                   1
#define FM0P_DS_CAL_KEY_AVAILABLE                 1
#define FM_DS_CAL_KEY_AVAILABLE                   1
#define FM0P_DS_CAL_SET_AVAILABLE                 1
#define FM_DS_CAL_SET_AVAILABLE                   1
#define FM0P_DS_DSRAMR_AVAILABLE                  1
#define FM_DS_DSRAMR_AVAILABLE                    1
#define FM0P_DS_MOSC_CTL_AVAILABLE                1
#define FM_DS_MOSC_CTL_AVAILABLE                  1
#define FM0P_DS_PMD_CTL_AVAILABLE                 1
#define FM_DS_PMD_CTL_AVAILABLE                   1
#define FM0P_DS_RCK_CTL_AVAILABLE                 1
#define FM_DS_RCK_CTL_AVAILABLE                   1
#define FM0P_DS_REG_CTL2_AVAILABLE                1
#define FM_DS_REG_CTL2_AVAILABLE                  1
#define FM0P_DS_STBFLASHPDX_AVAILABLE             1
#define FM_DS_STBFLASHPDX_AVAILABLE               1
#define FM0P_DS_WIER_AVAILABLE                    1
#define FM_DS_WIER_AVAILABLE                      1
#define FM0P_DS_WIFSR_AVAILABLE                   1
#define FM_DS_WIFSR_AVAILABLE                     1
#define FM0P_DS_WILVR_AVAILABLE                   1
#define FM_DS_WILVR_AVAILABLE                     1
#define FM0P_DS_WRFSR_AVAILABLE                   1
#define FM_DS_WRFSR_AVAILABLE                     1
/*******************************************************************************
* DSTC
*******************************************************************************/
#define FM0P_DSTC_CFG_AVAILABLE                   1
#define FM_DSTC_CFG_AVAILABLE                     1
#define FM0P_DSTC_CMD_AVAILABLE                   1
#define FM_DSTC_CMD_AVAILABLE                     1
#define FM0P_DSTC_DESTP_AVAILABLE                 1
#define FM_DSTC_DESTP_AVAILABLE                   1
#define FM0P_DSTC_DQMSK0_AVAILABLE                1
#define FM_DSTC_DQMSK0_AVAILABLE                  1
#define FM0P_DSTC_DQMSK1_AVAILABLE                1
#define FM_DSTC_DQMSK1_AVAILABLE                  1
#define FM0P_DSTC_DQMSK2_AVAILABLE                1
#define FM_DSTC_DQMSK2_AVAILABLE                  1
#define FM0P_DSTC_DQMSK3_AVAILABLE                1
#define FM_DSTC_DQMSK3_AVAILABLE                  1
#define FM0P_DSTC_DQMSK4_AVAILABLE                1
#define FM_DSTC_DQMSK4_AVAILABLE                  1
#define FM0P_DSTC_DQMSK5_AVAILABLE                1
#define FM_DSTC_DQMSK5_AVAILABLE                  1
#define FM0P_DSTC_DQMSK6_AVAILABLE                1
#define FM_DSTC_DQMSK6_AVAILABLE                  1
#define FM0P_DSTC_DQMSK7_AVAILABLE                1
#define FM_DSTC_DQMSK7_AVAILABLE                  1
#define FM0P_DSTC_DQMSKCLR0_AVAILABLE             1
#define FM_DSTC_DQMSKCLR0_AVAILABLE               1
#define FM0P_DSTC_DQMSKCLR1_AVAILABLE             1
#define FM_DSTC_DQMSKCLR1_AVAILABLE               1
#define FM0P_DSTC_DQMSKCLR2_AVAILABLE             1
#define FM_DSTC_DQMSKCLR2_AVAILABLE               1
#define FM0P_DSTC_DQMSKCLR3_AVAILABLE             1
#define FM_DSTC_DQMSKCLR3_AVAILABLE               1
#define FM0P_DSTC_DQMSKCLR4_AVAILABLE             1
#define FM_DSTC_DQMSKCLR4_AVAILABLE               1
#define FM0P_DSTC_DQMSKCLR5_AVAILABLE             1
#define FM_DSTC_DQMSKCLR5_AVAILABLE               1
#define FM0P_DSTC_DQMSKCLR6_AVAILABLE             1
#define FM_DSTC_DQMSKCLR6_AVAILABLE               1
#define FM0P_DSTC_DQMSKCLR7_AVAILABLE             1
#define FM_DSTC_DQMSKCLR7_AVAILABLE               1
#define FM0P_DSTC_DREQENB0_AVAILABLE              1
#define FM_DSTC_DREQENB0_AVAILABLE                1
#define FM0P_DSTC_DREQENB1_AVAILABLE              1
#define FM_DSTC_DREQENB1_AVAILABLE                1
#define FM0P_DSTC_DREQENB2_AVAILABLE              1
#define FM_DSTC_DREQENB2_AVAILABLE                1
#define FM0P_DSTC_DREQENB3_AVAILABLE              1
#define FM_DSTC_DREQENB3_AVAILABLE                1
#define FM0P_DSTC_DREQENB4_AVAILABLE              1
#define FM_DSTC_DREQENB4_AVAILABLE                1
#define FM0P_DSTC_DREQENB5_AVAILABLE              1
#define FM_DSTC_DREQENB5_AVAILABLE                1
#define FM0P_DSTC_DREQENB6_AVAILABLE              1
#define FM_DSTC_DREQENB6_AVAILABLE                1
#define FM0P_DSTC_DREQENB7_AVAILABLE              1
#define FM_DSTC_DREQENB7_AVAILABLE                1
#define FM0P_DSTC_HWDESP_AVAILABLE                1
#define FM_DSTC_HWDESP_AVAILABLE                  1
#define FM0P_DSTC_HWINT0_AVAILABLE                1
#define FM_DSTC_HWINT0_AVAILABLE                  1
#define FM0P_DSTC_HWINT1_AVAILABLE                1
#define FM_DSTC_HWINT1_AVAILABLE                  1
#define FM0P_DSTC_HWINT2_AVAILABLE                1
#define FM_DSTC_HWINT2_AVAILABLE                  1
#define FM0P_DSTC_HWINT3_AVAILABLE                1
#define FM_DSTC_HWINT3_AVAILABLE                  1
#define FM0P_DSTC_HWINT4_AVAILABLE                1
#define FM_DSTC_HWINT4_AVAILABLE                  1
#define FM0P_DSTC_HWINT5_AVAILABLE                1
#define FM_DSTC_HWINT5_AVAILABLE                  1
#define FM0P_DSTC_HWINT6_AVAILABLE                1
#define FM_DSTC_HWINT6_AVAILABLE                  1
#define FM0P_DSTC_HWINT7_AVAILABLE                1
#define FM_DSTC_HWINT7_AVAILABLE                  1
#define FM0P_DSTC_HWINTCLR0_AVAILABLE             1
#define FM_DSTC_HWINTCLR0_AVAILABLE               1
#define FM0P_DSTC_HWINTCLR1_AVAILABLE             1
#define FM_DSTC_HWINTCLR1_AVAILABLE               1
#define FM0P_DSTC_HWINTCLR2_AVAILABLE             1
#define FM_DSTC_HWINTCLR2_AVAILABLE               1
#define FM0P_DSTC_HWINTCLR3_AVAILABLE             1
#define FM_DSTC_HWINTCLR3_AVAILABLE               1
#define FM0P_DSTC_HWINTCLR4_AVAILABLE             1
#define FM_DSTC_HWINTCLR4_AVAILABLE               1
#define FM0P_DSTC_HWINTCLR5_AVAILABLE             1
#define FM_DSTC_HWINTCLR5_AVAILABLE               1
#define FM0P_DSTC_HWINTCLR6_AVAILABLE             1
#define FM_DSTC_HWINTCLR6_AVAILABLE               1
#define FM0P_DSTC_HWINTCLR7_AVAILABLE             1
#define FM_DSTC_HWINTCLR7_AVAILABLE               1
#define FM0P_DSTC_MONERS_AVAILABLE                1
#define FM_DSTC_MONERS_AVAILABLE                  1
#define FM0P_DSTC_SWTR_AVAILABLE                  1
#define FM_DSTC_SWTR_AVAILABLE                    1
/*******************************************************************************
* DT
*******************************************************************************/
#define FM0P_DT_TIMER1BGLOAD_AVAILABLE            1
#define FM_DT_TIMER1BGLOAD_AVAILABLE              1
#define FM0P_DT_TIMER1CONTROL_AVAILABLE           1
#define FM_DT_TIMER1CONTROL_AVAILABLE             1
#define FM0P_DT_TIMER1INTCLR_AVAILABLE            1
#define FM_DT_TIMER1INTCLR_AVAILABLE              1
#define FM0P_DT_TIMER1LOAD_AVAILABLE              1
#define FM_DT_TIMER1LOAD_AVAILABLE                1
#define FM0P_DT_TIMER1MIS_AVAILABLE               1
#define FM_DT_TIMER1MIS_AVAILABLE                 1
#define FM0P_DT_TIMER1RIS_AVAILABLE               1
#define FM_DT_TIMER1RIS_AVAILABLE                 1
#define FM0P_DT_TIMER1VALUE_AVAILABLE             1
#define FM_DT_TIMER1VALUE_AVAILABLE               1
#define FM0P_DT_TIMER2BGLOAD_AVAILABLE            1
#define FM_DT_TIMER2BGLOAD_AVAILABLE              1
#define FM0P_DT_TIMER2CONTROL_AVAILABLE           1
#define FM_DT_TIMER2CONTROL_AVAILABLE             1
#define FM0P_DT_TIMER2INTCLR_AVAILABLE            1
#define FM_DT_TIMER2INTCLR_AVAILABLE              1
#define FM0P_DT_TIMER2LOAD_AVAILABLE              1
#define FM_DT_TIMER2LOAD_AVAILABLE                1
#define FM0P_DT_TIMER2MIS_AVAILABLE               1
#define FM_DT_TIMER2MIS_AVAILABLE                 1
#define FM0P_DT_TIMER2RIS_AVAILABLE               1
#define FM_DT_TIMER2RIS_AVAILABLE                 1
