mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xe/common/s6e1b8xe.h
#define bFM_EXTI_NMICL_NCL                        *((volatile  uint8_t *)(0x42600300UL))
#define bFM0P_EXTI_NMICL_NCL                      *((volatile  uint8_t *)(0x42600300UL))

#define bFM_EXTI_NMIRR_NR                         *((volatile  uint8_t *)(0x42600280UL))
#define bFM0P_EXTI_NMIRR_NR                       *((volatile  uint8_t *)(0x42600280UL))


/*******************************************************************************
* FASTIO Registers FASTIO
*   Bitband Section
*******************************************************************************/
#define bFM_FASTIO_FPDIR0_P0                      *((volatile  uint8_t *)(0xF8010004UL))
#define bFM0P_FASTIO_FPDIR0_P0                    *((volatile  uint8_t *)(0xF8010004UL))
#define bFM_FASTIO_FPDIR0_P1                      *((volatile  uint8_t *)(0xF8010008UL))
#define bFM0P_FASTIO_FPDIR0_P1                    *((volatile  uint8_t *)(0xF8010008UL))
#define bFM_FASTIO_FPDIR0_P2                      *((volatile  uint8_t *)(0xF8010010UL))
#define bFM0P_FASTIO_FPDIR0_P2                    *((volatile  uint8_t *)(0xF8010010UL))
#define bFM_FASTIO_FPDIR0_P3                      *((volatile  uint8_t *)(0xF8010020UL))
#define bFM0P_FASTIO_FPDIR0_P3                    *((volatile  uint8_t *)(0xF8010020UL))
#define bFM_FASTIO_FPDIR0_P4                      *((volatile  uint8_t *)(0xF8010040UL))
#define bFM0P_FASTIO_FPDIR0_P4                    *((volatile  uint8_t *)(0xF8010040UL))
#define bFM_FASTIO_FPDIR0_P7                      *((volatile  uint8_t *)(0xF8010200UL))
#define bFM0P_FASTIO_FPDIR0_P7                    *((volatile  uint8_t *)(0xF8010200UL))
#define bFM_FASTIO_FPDIR0_PA                      *((volatile  uint8_t *)(0xF8010011UL))
#define bFM0P_FASTIO_FPDIR0_PA                    *((volatile  uint8_t *)(0xF8010011UL))
#define bFM_FASTIO_FPDIR0_PB                      *((volatile  uint8_t *)(0xF8010021UL))
#define bFM0P_FASTIO_FPDIR0_PB                    *((volatile  uint8_t *)(0xF8010021UL))
#define bFM_FASTIO_FPDIR0_PC                      *((volatile  uint8_t *)(0xF8010041UL))
#define bFM0P_FASTIO_FPDIR0_PC                    *((volatile  uint8_t *)(0xF8010041UL))
#define bFM_FASTIO_FPDIR0_PD                      *((volatile  uint8_t *)(0xF8010081UL))
#define bFM0P_FASTIO_FPDIR0_PD                    *((volatile  uint8_t *)(0xF8010081UL))
#define bFM_FASTIO_FPDIR0_PE                      *((volatile  uint8_t *)(0xF8010101UL))
#define bFM0P_FASTIO_FPDIR0_PE                    *((volatile  uint8_t *)(0xF8010101UL))
#define bFM_FASTIO_FPDIR0_PF                      *((volatile  uint8_t *)(0xF8010201UL))
#define bFM0P_FASTIO_FPDIR0_PF                    *((volatile  uint8_t *)(0xF8010201UL))

#define bFM_FASTIO_FPDIR1_P0                      *((volatile  uint8_t *)(0xF8010404UL))
#define bFM0P_FASTIO_FPDIR1_P0                    *((volatile  uint8_t *)(0xF8010404UL))
#define bFM_FASTIO_FPDIR1_P1                      *((volatile  uint8_t *)(0xF8010408UL))
#define bFM0P_FASTIO_FPDIR1_P1                    *((volatile  uint8_t *)(0xF8010408UL))
#define bFM_FASTIO_FPDIR1_P2                      *((volatile  uint8_t *)(0xF8010410UL))
#define bFM0P_FASTIO_FPDIR1_P2                    *((volatile  uint8_t *)(0xF8010410UL))
#define bFM_FASTIO_FPDIR1_P3                      *((volatile  uint8_t *)(0xF8010420UL))
#define bFM0P_FASTIO_FPDIR1_P3                    *((volatile  uint8_t *)(0xF8010420UL))
#define bFM_FASTIO_FPDIR1_P4                      *((volatile  uint8_t *)(0xF8010440UL))
#define bFM0P_FASTIO_FPDIR1_P4                    *((volatile  uint8_t *)(0xF8010440UL))
#define bFM_FASTIO_FPDIR1_P5                      *((volatile  uint8_t *)(0xF8010480UL))
#define bFM0P_FASTIO_FPDIR1_P5                    *((volatile  uint8_t *)(0xF8010480UL))
#define bFM_FASTIO_FPDIR1_P6                      *((volatile  uint8_t *)(0xF8010500UL))
#define bFM0P_FASTIO_FPDIR1_P6                    *((volatile  uint8_t *)(0xF8010500UL))
#define bFM_FASTIO_FPDIR1_P7                      *((volatile  uint8_t *)(0xF8010600UL))
#define bFM0P_FASTIO_FPDIR1_P7                    *((volatile  uint8_t *)(0xF8010600UL))
#define bFM_FASTIO_FPDIR1_P8                      *((volatile  uint8_t *)(0xF8010405UL))
#define bFM0P_FASTIO_FPDIR1_P8                    *((volatile  uint8_t *)(0xF8010405UL))
#define bFM_FASTIO_FPDIR1_P9                      *((volatile  uint8_t *)(0xF8010409UL))
#define bFM0P_FASTIO_FPDIR1_P9                    *((volatile  uint8_t *)(0xF8010409UL))
#define bFM_FASTIO_FPDIR1_PA                      *((volatile  uint8_t *)(0xF8010411UL))
#define bFM0P_FASTIO_FPDIR1_PA                    *((volatile  uint8_t *)(0xF8010411UL))
#define bFM_FASTIO_FPDIR1_PB                      *((volatile  uint8_t *)(0xF8010421UL))
#define bFM0P_FASTIO_FPDIR1_PB                    *((volatile  uint8_t *)(0xF8010421UL))

#define bFM_FASTIO_FPDIR2_P1                      *((volatile  uint8_t *)(0xF8010808UL))
#define bFM0P_FASTIO_FPDIR2_P1                    *((volatile  uint8_t *)(0xF8010808UL))
#define bFM_FASTIO_FPDIR2_P2                      *((volatile  uint8_t *)(0xF8010810UL))
#define bFM0P_FASTIO_FPDIR2_P2                    *((volatile  uint8_t *)(0xF8010810UL))
#define bFM_FASTIO_FPDIR2_P3                      *((volatile  uint8_t *)(0xF8010820UL))
#define bFM0P_FASTIO_FPDIR2_P3                    *((volatile  uint8_t *)(0xF8010820UL))

#define bFM_FASTIO_FPDIR3_P0                      *((volatile  uint8_t *)(0xF8010C04UL))
#define bFM0P_FASTIO_FPDIR3_P0                    *((volatile  uint8_t *)(0xF8010C04UL))
#define bFM_FASTIO_FPDIR3_P1                      *((volatile  uint8_t *)(0xF8010C08UL))
#define bFM0P_FASTIO_FPDIR3_P1                    *((volatile  uint8_t *)(0xF8010C08UL))
#define bFM_FASTIO_FPDIR3_P2                      *((volatile  uint8_t *)(0xF8010C10UL))
#define bFM0P_FASTIO_FPDIR3_P2                    *((volatile  uint8_t *)(0xF8010C10UL))
#define bFM_FASTIO_FPDIR3_P3                      *((volatile  uint8_t *)(0xF8010C20UL))
#define bFM0P_FASTIO_FPDIR3_P3                    *((volatile  uint8_t *)(0xF8010C20UL))
#define bFM_FASTIO_FPDIR3_P9                      *((volatile  uint8_t *)(0xF8010C09UL))
#define bFM0P_FASTIO_FPDIR3_P9                    *((volatile  uint8_t *)(0xF8010C09UL))
#define bFM_FASTIO_FPDIR3_PA                      *((volatile  uint8_t *)(0xF8010C11UL))
#define bFM0P_FASTIO_FPDIR3_PA                    *((volatile  uint8_t *)(0xF8010C11UL))
#define bFM_FASTIO_FPDIR3_PB                      *((volatile  uint8_t *)(0xF8010C21UL))
#define bFM0P_FASTIO_FPDIR3_PB                    *((volatile  uint8_t *)(0xF8010C21UL))
#define bFM_FASTIO_FPDIR3_PC                      *((volatile  uint8_t *)(0xF8010C41UL))
#define bFM0P_FASTIO_FPDIR3_PC                    *((volatile  uint8_t *)(0xF8010C41UL))
#define bFM_FASTIO_FPDIR3_PD                      *((volatile  uint8_t *)(0xF8010C81UL))
#define bFM0P_FASTIO_FPDIR3_PD                    *((volatile  uint8_t *)(0xF8010C81UL))
#define bFM_FASTIO_FPDIR3_PE                      *((volatile  uint8_t *)(0xF8010D01UL))
#define bFM0P_FASTIO_FPDIR3_PE                    *((volatile  uint8_t *)(0xF8010D01UL))
#define bFM_FASTIO_FPDIR3_PF                      *((volatile  uint8_t *)(0xF8010E01UL))
#define bFM0P_FASTIO_FPDIR3_PF                    *((volatile  uint8_t *)(0xF8010E01UL))

