mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xe/common/s6e1b8xe.h
/*******************************************************************************
* FLASH_IF Registers FLASH_IF
*   Bitband Section
*******************************************************************************/
#define bFM_FLASH_IF_FICLR_RDYC                   *((volatile  uint8_t *)(0x42000500UL))
#define bFM0P_FLASH_IF_FICLR_RDYC                 *((volatile  uint8_t *)(0x42000500UL))
#define bFM_FLASH_IF_FICLR_HANGC                  *((volatile  uint8_t *)(0x42000504UL))
#define bFM0P_FLASH_IF_FICLR_HANGC                *((volatile  uint8_t *)(0x42000504UL))

#define bFM_FLASH_IF_FICR_RDYIE                   *((volatile  uint8_t *)(0x42000400UL))
#define bFM0P_FLASH_IF_FICR_RDYIE                 *((volatile  uint8_t *)(0x42000400UL))
#define bFM_FLASH_IF_FICR_HANGIE                  *((volatile  uint8_t *)(0x42000404UL))
#define bFM0P_FLASH_IF_FICR_HANGIE                *((volatile  uint8_t *)(0x42000404UL))

#define bFM_FLASH_IF_FISR_RDYIF                   *((volatile  uint8_t *)(0x42000480UL))
#define bFM0P_FLASH_IF_FISR_RDYIF                 *((volatile  uint8_t *)(0x42000480UL))
#define bFM_FLASH_IF_FISR_HANGIF                  *((volatile  uint8_t *)(0x42000484UL))
#define bFM0P_FLASH_IF_FISR_HANGIF                *((volatile  uint8_t *)(0x42000484UL))

#define bFM_FLASH_IF_FSTR_RDY                     *((volatile  uint8_t *)(0x42000100UL))
#define bFM0P_FLASH_IF_FSTR_RDY                   *((volatile  uint8_t *)(0x42000100UL))
#define bFM_FLASH_IF_FSTR_HNG                     *((volatile  uint8_t *)(0x42000104UL))
#define bFM0P_FLASH_IF_FSTR_HNG                   *((volatile  uint8_t *)(0x42000104UL))
#define bFM_FLASH_IF_FSTR_CERS                    *((volatile  uint8_t *)(0x42000108UL))
#define bFM0P_FLASH_IF_FSTR_CERS                  *((volatile  uint8_t *)(0x42000108UL))
#define bFM_FLASH_IF_FSTR_ESPS                    *((volatile  uint8_t *)(0x4200010CUL))
#define bFM0P_FLASH_IF_FSTR_ESPS                  *((volatile  uint8_t *)(0x4200010CUL))
#define bFM_FLASH_IF_FSTR_SERS                    *((volatile  uint8_t *)(0x42000110UL))
#define bFM0P_FLASH_IF_FSTR_SERS                  *((volatile  uint8_t *)(0x42000110UL))
#define bFM_FLASH_IF_FSTR_PGMS                    *((volatile  uint8_t *)(0x42000114UL))
#define bFM0P_FLASH_IF_FSTR_PGMS                  *((volatile  uint8_t *)(0x42000114UL))


/*******************************************************************************
* GPIO Registers GPIO
*   Bitband Section
*******************************************************************************/
#define bFM_GPIO_ADE_AN00                         *((volatile  uint8_t *)(0x4266A000UL))
#define bFM0P_GPIO_ADE_AN00                       *((volatile  uint8_t *)(0x4266A000UL))
#define bFM_GPIO_ADE_AN01                         *((volatile  uint8_t *)(0x4266A004UL))
#define bFM0P_GPIO_ADE_AN01                       *((volatile  uint8_t *)(0x4266A004UL))
#define bFM_GPIO_ADE_AN02                         *((volatile  uint8_t *)(0x4266A008UL))
#define bFM0P_GPIO_ADE_AN02                       *((volatile  uint8_t *)(0x4266A008UL))
#define bFM_GPIO_ADE_AN03                         *((volatile  uint8_t *)(0x4266A00CUL))
#define bFM0P_GPIO_ADE_AN03                       *((volatile  uint8_t *)(0x4266A00CUL))
#define bFM_GPIO_ADE_AN04                         *((volatile  uint8_t *)(0x4266A010UL))
#define bFM0P_GPIO_ADE_AN04                       *((volatile  uint8_t *)(0x4266A010UL))
#define bFM_GPIO_ADE_AN05                         *((volatile  uint8_t *)(0x4266A014UL))
#define bFM0P_GPIO_ADE_AN05                       *((volatile  uint8_t *)(0x4266A014UL))
#define bFM_GPIO_ADE_AN06                         *((volatile  uint8_t *)(0x4266A018UL))
#define bFM0P_GPIO_ADE_AN06                       *((volatile  uint8_t *)(0x4266A018UL))
#define bFM_GPIO_ADE_AN07                         *((volatile  uint8_t *)(0x4266A01CUL))
#define bFM0P_GPIO_ADE_AN07                       *((volatile  uint8_t *)(0x4266A01CUL))
#define bFM_GPIO_ADE_AN08                         *((volatile  uint8_t *)(0x4266A020UL))
#define bFM0P_GPIO_ADE_AN08                       *((volatile  uint8_t *)(0x4266A020UL))
#define bFM_GPIO_ADE_AN09                         *((volatile  uint8_t *)(0x4266A024UL))
#define bFM0P_GPIO_ADE_AN09                       *((volatile  uint8_t *)(0x4266A024UL))
#define bFM_GPIO_ADE_AN10                         *((volatile  uint8_t *)(0x4266A028UL))
#define bFM0P_GPIO_ADE_AN10                       *((volatile  uint8_t *)(0x4266A028UL))
#define bFM_GPIO_ADE_AN11                         *((volatile  uint8_t *)(0x4266A02CUL))
#define bFM0P_GPIO_ADE_AN11                       *((volatile  uint8_t *)(0x4266A02CUL))
#define bFM_GPIO_ADE_AN16                         *((volatile  uint8_t *)(0x4266A040UL))
#define bFM0P_GPIO_ADE_AN16                       *((volatile  uint8_t *)(0x4266A040UL))
#define bFM_GPIO_ADE_AN17                         *((volatile  uint8_t *)(0x4266A044UL))
#define bFM0P_GPIO_ADE_AN17                       *((volatile  uint8_t *)(0x4266A044UL))
#define bFM_GPIO_ADE_AN18                         *((volatile  uint8_t *)(0x4266A048UL))
#define bFM0P_GPIO_ADE_AN18                       *((volatile  uint8_t *)(0x4266A048UL))
#define bFM_GPIO_ADE_AN22                         *((volatile  uint8_t *)(0x4266A058UL))
#define bFM0P_GPIO_ADE_AN22                       *((volatile  uint8_t *)(0x4266A058UL))

#define bFM_GPIO_DDR0_P0                          *((volatile  uint8_t *)(0x42664000UL))
#define bFM0P_GPIO_DDR0_P0                        *((volatile  uint8_t *)(0x42664000UL))
#define bFM_GPIO_DDR0_P1                          *((volatile  uint8_t *)(0x42664004UL))
#define bFM0P_GPIO_DDR0_P1                        *((volatile  uint8_t *)(0x42664004UL))
#define bFM_GPIO_DDR0_P2                          *((volatile  uint8_t *)(0x42664008UL))
#define bFM0P_GPIO_DDR0_P2                        *((volatile  uint8_t *)(0x42664008UL))
#define bFM_GPIO_DDR0_P3                          *((volatile  uint8_t *)(0x4266400CUL))
#define bFM0P_GPIO_DDR0_P3                        *((volatile  uint8_t *)(0x4266400CUL))
#define bFM_GPIO_DDR0_P4                          *((volatile  uint8_t *)(0x42664010UL))
#define bFM0P_GPIO_DDR0_P4                        *((volatile  uint8_t *)(0x42664010UL))
#define bFM_GPIO_DDR0_P7                          *((volatile  uint8_t *)(0x4266401CUL))
#define bFM0P_GPIO_DDR0_P7                        *((volatile  uint8_t *)(0x4266401CUL))
#define bFM_GPIO_DDR0_PA                          *((volatile  uint8_t *)(0x42664028UL))
#define bFM0P_GPIO_DDR0_PA                        *((volatile  uint8_t *)(0x42664028UL))
#define bFM_GPIO_DDR0_PB                          *((volatile  uint8_t *)(0x4266402CUL))
#define bFM0P_GPIO_DDR0_PB                        *((volatile  uint8_t *)(0x4266402CUL))
#define bFM_GPIO_DDR0_PC                          *((volatile  uint8_t *)(0x42664030UL))
#define bFM0P_GPIO_DDR0_PC                        *((volatile  uint8_t *)(0x42664030UL))
#define bFM_GPIO_DDR0_PD                          *((volatile  uint8_t *)(0x42664034UL))
#define bFM0P_GPIO_DDR0_PD                        *((volatile  uint8_t *)(0x42664034UL))
#define bFM_GPIO_DDR0_PE                          *((volatile  uint8_t *)(0x42664038UL))
#define bFM0P_GPIO_DDR0_PE                        *((volatile  uint8_t *)(0x42664038UL))
#define bFM_GPIO_DDR0_PF                          *((volatile  uint8_t *)(0x4266403CUL))
#define bFM0P_GPIO_DDR0_PF                        *((volatile  uint8_t *)(0x4266403CUL))

#define bFM_GPIO_DDR1_P0                          *((volatile  uint8_t *)(0x42664080UL))
#define bFM0P_GPIO_DDR1_P0                        *((volatile  uint8_t *)(0x42664080UL))
#define bFM_GPIO_DDR1_P1                          *((volatile  uint8_t *)(0x42664084UL))
#define bFM0P_GPIO_DDR1_P1                        *((volatile  uint8_t *)(0x42664084UL))
#define bFM_GPIO_DDR1_P2                          *((volatile  uint8_t *)(0x42664088UL))
#define bFM0P_GPIO_DDR1_P2                        *((volatile  uint8_t *)(0x42664088UL))
#define bFM_GPIO_DDR1_P3                          *((volatile  uint8_t *)(0x4266408CUL))
#define bFM0P_GPIO_DDR1_P3                        *((volatile  uint8_t *)(0x4266408CUL))
#define bFM_GPIO_DDR1_P4                          *((volatile  uint8_t *)(0x42664090UL))
#define bFM0P_GPIO_DDR1_P4                        *((volatile  uint8_t *)(0x42664090UL))
#define bFM_GPIO_DDR1_P5                          *((volatile  uint8_t *)(0x42664094UL))
#define bFM0P_GPIO_DDR1_P5                        *((volatile  uint8_t *)(0x42664094UL))
#define bFM_GPIO_DDR1_P6                          *((volatile  uint8_t *)(0x42664098UL))
#define bFM0P_GPIO_DDR1_P6                        *((volatile  uint8_t *)(0x42664098UL))
#define bFM_GPIO_DDR1_P7                          *((volatile  uint8_t *)(0x4266409CUL))
#define bFM0P_GPIO_DDR1_P7                        *((volatile  uint8_t *)(0x4266409CUL))
#define bFM_GPIO_DDR1_P8                          *((volatile  uint8_t *)(0x426640A0UL))
#define bFM0P_GPIO_DDR1_P8                        *((volatile  uint8_t *)(0x426640A0UL))
#define bFM_GPIO_DDR1_P9                          *((volatile  uint8_t *)(0x426640A4UL))
#define bFM0P_GPIO_DDR1_P9                        *((volatile  uint8_t *)(0x426640A4UL))
#define bFM_GPIO_DDR1_PA                          *((volatile  uint8_t *)(0x426640A8UL))
#define bFM0P_GPIO_DDR1_PA                        *((volatile  uint8_t *)(0x426640A8UL))
#define bFM_GPIO_DDR1_PB                          *((volatile  uint8_t *)(0x426640ACUL))
#define bFM0P_GPIO_DDR1_PB                        *((volatile  uint8_t *)(0x426640ACUL))

#define bFM_GPIO_DDR2_P1                          *((volatile  uint8_t *)(0x42664104UL))
#define bFM0P_GPIO_DDR2_P1                        *((volatile  uint8_t *)(0x42664104UL))
#define bFM_GPIO_DDR2_P2                          *((volatile  uint8_t *)(0x42664108UL))
#define bFM0P_GPIO_DDR2_P2                        *((volatile  uint8_t *)(0x42664108UL))
#define bFM_GPIO_DDR2_P3                          *((volatile  uint8_t *)(0x4266410CUL))
#define bFM0P_GPIO_DDR2_P3                        *((volatile  uint8_t *)(0x4266410CUL))

#define bFM_GPIO_DDR3_P0                          *((volatile  uint8_t *)(0x42664180UL))
#define bFM0P_GPIO_DDR3_P0                        *((volatile  uint8_t *)(0x42664180UL))
#define bFM_GPIO_DDR3_P1                          *((volatile  uint8_t *)(0x42664184UL))
#define bFM0P_GPIO_DDR3_P1                        *((volatile  uint8_t *)(0x42664184UL))
#define bFM_GPIO_DDR3_P2                          *((volatile  uint8_t *)(0x42664188UL))
#define bFM0P_GPIO_DDR3_P2                        *((volatile  uint8_t *)(0x42664188UL))
#define bFM_GPIO_DDR3_P3                          *((volatile  uint8_t *)(0x4266418CUL))
#define bFM0P_GPIO_DDR3_P3                        *((volatile  uint8_t *)(0x4266418CUL))
#define bFM_GPIO_DDR3_P9                          *((volatile  uint8_t *)(0x426641A4UL))
#define bFM0P_GPIO_DDR3_P9                        *((volatile  uint8_t *)(0x426641A4UL))
#define bFM_GPIO_DDR3_PA                          *((volatile  uint8_t *)(0x426641A8UL))
#define bFM0P_GPIO_DDR3_PA                        *((volatile  uint8_t *)(0x426641A8UL))
#define bFM_GPIO_DDR3_PB                          *((volatile  uint8_t *)(0x426641ACUL))
#define bFM0P_GPIO_DDR3_PB                        *((volatile  uint8_t *)(0x426641ACUL))
#define bFM_GPIO_DDR3_PC                          *((volatile  uint8_t *)(0x426641B0UL))
#define bFM0P_GPIO_DDR3_PC                        *((volatile  uint8_t *)(0x426641B0UL))
#define bFM_GPIO_DDR3_PD                          *((volatile  uint8_t *)(0x426641B4UL))
#define bFM0P_GPIO_DDR3_PD                        *((volatile  uint8_t *)(0x426641B4UL))
#define bFM_GPIO_DDR3_PE                          *((volatile  uint8_t *)(0x426641B8UL))
#define bFM0P_GPIO_DDR3_PE                        *((volatile  uint8_t *)(0x426641B8UL))
#define bFM_GPIO_DDR3_PF                          *((volatile  uint8_t *)(0x426641BCUL))
#define bFM0P_GPIO_DDR3_PF                        *((volatile  uint8_t *)(0x426641BCUL))

#define bFM_GPIO_DDR4_P4                          *((volatile  uint8_t *)(0x42664210UL))
#define bFM0P_GPIO_DDR4_P4                        *((volatile  uint8_t *)(0x42664210UL))
#define bFM_GPIO_DDR4_P5                          *((volatile  uint8_t *)(0x42664214UL))
#define bFM0P_GPIO_DDR4_P5                        *((volatile  uint8_t *)(0x42664214UL))
#define bFM_GPIO_DDR4_P6                          *((volatile  uint8_t *)(0x42664218UL))
#define bFM0P_GPIO_DDR4_P6                        *((volatile  uint8_t *)(0x42664218UL))
#define bFM_GPIO_DDR4_P7                          *((volatile  uint8_t *)(0x4266421CUL))
#define bFM0P_GPIO_DDR4_P7                        *((volatile  uint8_t *)(0x4266421CUL))
#define bFM_GPIO_DDR4_P8                          *((volatile  uint8_t *)(0x42664220UL))
#define bFM0P_GPIO_DDR4_P8                        *((volatile  uint8_t *)(0x42664220UL))
#define bFM_GPIO_DDR4_P9                          *((volatile  uint8_t *)(0x42664224UL))
#define bFM0P_GPIO_DDR4_P9                        *((volatile  uint8_t *)(0x42664224UL))
#define bFM_GPIO_DDR4_PA                          *((volatile  uint8_t *)(0x42664228UL))
#define bFM0P_GPIO_DDR4_PA                        *((volatile  uint8_t *)(0x42664228UL))
#define bFM_GPIO_DDR4_PB                          *((volatile  uint8_t *)(0x4266422CUL))
#define bFM0P_GPIO_DDR4_PB                        *((volatile  uint8_t *)(0x4266422CUL))
#define bFM_GPIO_DDR4_PC                          *((volatile  uint8_t *)(0x42664230UL))
#define bFM0P_GPIO_DDR4_PC                        *((volatile  uint8_t *)(0x42664230UL))
#define bFM_GPIO_DDR4_PD                          *((volatile  uint8_t *)(0x42664234UL))
#define bFM0P_GPIO_DDR4_PD                        *((volatile  uint8_t *)(0x42664234UL))

#define bFM_GPIO_DDR5_P0                          *((volatile  uint8_t *)(0x42664280UL))
#define bFM0P_GPIO_DDR5_P0                        *((volatile  uint8_t *)(0x42664280UL))
#define bFM_GPIO_DDR5_P1                          *((volatile  uint8_t *)(0x42664284UL))
#define bFM0P_GPIO_DDR5_P1                        *((volatile  uint8_t *)(0x42664284UL))
#define bFM_GPIO_DDR5_P2                          *((volatile  uint8_t *)(0x42664288UL))
#define bFM0P_GPIO_DDR5_P2                        *((volatile  uint8_t *)(0x42664288UL))
#define bFM_GPIO_DDR5_P3                          *((volatile  uint8_t *)(0x4266428CUL))
#define bFM0P_GPIO_DDR5_P3                        *((volatile  uint8_t *)(0x4266428CUL))
#define bFM_GPIO_DDR5_P4                          *((volatile  uint8_t *)(0x42664290UL))
#define bFM0P_GPIO_DDR5_P4                        *((volatile  uint8_t *)(0x42664290UL))
#define bFM_GPIO_DDR5_P5                          *((volatile  uint8_t *)(0x42664294UL))
#define bFM0P_GPIO_DDR5_P5                        *((volatile  uint8_t *)(0x42664294UL))
#define bFM_GPIO_DDR5_P6                          *((volatile  uint8_t *)(0x42664298UL))
#define bFM0P_GPIO_DDR5_P6                        *((volatile  uint8_t *)(0x42664298UL))

#define bFM_GPIO_DDR6_P0                          *((volatile  uint8_t *)(0x42664300UL))
#define bFM0P_GPIO_DDR6_P0                        *((volatile  uint8_t *)(0x42664300UL))
#define bFM_GPIO_DDR6_P1                          *((volatile  uint8_t *)(0x42664304UL))
#define bFM0P_GPIO_DDR6_P1                        *((volatile  uint8_t *)(0x42664304UL))
#define bFM_GPIO_DDR6_P2                          *((volatile  uint8_t *)(0x42664308UL))
#define bFM0P_GPIO_DDR6_P2                        *((volatile  uint8_t *)(0x42664308UL))
#define bFM_GPIO_DDR6_P3                          *((volatile  uint8_t *)(0x4266430CUL))
#define bFM0P_GPIO_DDR6_P3                        *((volatile  uint8_t *)(0x4266430CUL))

