mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xe/common/s6e1b8xe.h
#define bFM_GPIO_PCR4_P4                          *((volatile  uint8_t *)(0x42662210UL))
#define bFM0P_GPIO_PCR4_P4                        *((volatile  uint8_t *)(0x42662210UL))
#define bFM_GPIO_PCR4_P5                          *((volatile  uint8_t *)(0x42662214UL))
#define bFM0P_GPIO_PCR4_P5                        *((volatile  uint8_t *)(0x42662214UL))
#define bFM_GPIO_PCR4_P6                          *((volatile  uint8_t *)(0x42662218UL))
#define bFM0P_GPIO_PCR4_P6                        *((volatile  uint8_t *)(0x42662218UL))
#define bFM_GPIO_PCR4_P7                          *((volatile  uint8_t *)(0x4266221CUL))
#define bFM0P_GPIO_PCR4_P7                        *((volatile  uint8_t *)(0x4266221CUL))
#define bFM_GPIO_PCR4_P8                          *((volatile  uint8_t *)(0x42662220UL))
#define bFM0P_GPIO_PCR4_P8                        *((volatile  uint8_t *)(0x42662220UL))
#define bFM_GPIO_PCR4_P9                          *((volatile  uint8_t *)(0x42662224UL))
#define bFM0P_GPIO_PCR4_P9                        *((volatile  uint8_t *)(0x42662224UL))
#define bFM_GPIO_PCR4_PA                          *((volatile  uint8_t *)(0x42662228UL))
#define bFM0P_GPIO_PCR4_PA                        *((volatile  uint8_t *)(0x42662228UL))
#define bFM_GPIO_PCR4_PB                          *((volatile  uint8_t *)(0x4266222CUL))
#define bFM0P_GPIO_PCR4_PB                        *((volatile  uint8_t *)(0x4266222CUL))
#define bFM_GPIO_PCR4_PC                          *((volatile  uint8_t *)(0x42662230UL))
#define bFM0P_GPIO_PCR4_PC                        *((volatile  uint8_t *)(0x42662230UL))
#define bFM_GPIO_PCR4_PD                          *((volatile  uint8_t *)(0x42662234UL))
#define bFM0P_GPIO_PCR4_PD                        *((volatile  uint8_t *)(0x42662234UL))

#define bFM_GPIO_PCR5_P0                          *((volatile  uint8_t *)(0x42662280UL))
#define bFM0P_GPIO_PCR5_P0                        *((volatile  uint8_t *)(0x42662280UL))
#define bFM_GPIO_PCR5_P1                          *((volatile  uint8_t *)(0x42662284UL))
#define bFM0P_GPIO_PCR5_P1                        *((volatile  uint8_t *)(0x42662284UL))
#define bFM_GPIO_PCR5_P2                          *((volatile  uint8_t *)(0x42662288UL))
#define bFM0P_GPIO_PCR5_P2                        *((volatile  uint8_t *)(0x42662288UL))
#define bFM_GPIO_PCR5_P3                          *((volatile  uint8_t *)(0x4266228CUL))
#define bFM0P_GPIO_PCR5_P3                        *((volatile  uint8_t *)(0x4266228CUL))
#define bFM_GPIO_PCR5_P4                          *((volatile  uint8_t *)(0x42662290UL))
#define bFM0P_GPIO_PCR5_P4                        *((volatile  uint8_t *)(0x42662290UL))
#define bFM_GPIO_PCR5_P5                          *((volatile  uint8_t *)(0x42662294UL))
#define bFM0P_GPIO_PCR5_P5                        *((volatile  uint8_t *)(0x42662294UL))
#define bFM_GPIO_PCR5_P6                          *((volatile  uint8_t *)(0x42662298UL))
#define bFM0P_GPIO_PCR5_P6                        *((volatile  uint8_t *)(0x42662298UL))

#define bFM_GPIO_PCR6_P0                          *((volatile  uint8_t *)(0x42662300UL))
#define bFM0P_GPIO_PCR6_P0                        *((volatile  uint8_t *)(0x42662300UL))
#define bFM_GPIO_PCR6_P1                          *((volatile  uint8_t *)(0x42662304UL))
#define bFM0P_GPIO_PCR6_P1                        *((volatile  uint8_t *)(0x42662304UL))
#define bFM_GPIO_PCR6_P2                          *((volatile  uint8_t *)(0x42662308UL))
#define bFM0P_GPIO_PCR6_P2                        *((volatile  uint8_t *)(0x42662308UL))
#define bFM_GPIO_PCR6_P3                          *((volatile  uint8_t *)(0x4266230CUL))
#define bFM0P_GPIO_PCR6_P3                        *((volatile  uint8_t *)(0x4266230CUL))

#define bFM_GPIO_PCRE_P0                          *((volatile  uint8_t *)(0x42662700UL))
#define bFM0P_GPIO_PCRE_P0                        *((volatile  uint8_t *)(0x42662700UL))
#define bFM_GPIO_PCRE_P2                          *((volatile  uint8_t *)(0x42662708UL))
#define bFM0P_GPIO_PCRE_P2                        *((volatile  uint8_t *)(0x42662708UL))
#define bFM_GPIO_PCRE_P3                          *((volatile  uint8_t *)(0x4266270CUL))
#define bFM0P_GPIO_PCRE_P3                        *((volatile  uint8_t *)(0x4266270CUL))

#define bFM_GPIO_PDIR0_P0                         *((volatile  uint8_t *)(0x42666000UL))
#define bFM0P_GPIO_PDIR0_P0                       *((volatile  uint8_t *)(0x42666000UL))
#define bFM_GPIO_PDIR0_P1                         *((volatile  uint8_t *)(0x42666004UL))
#define bFM0P_GPIO_PDIR0_P1                       *((volatile  uint8_t *)(0x42666004UL))
#define bFM_GPIO_PDIR0_P2                         *((volatile  uint8_t *)(0x42666008UL))
#define bFM0P_GPIO_PDIR0_P2                       *((volatile  uint8_t *)(0x42666008UL))
#define bFM_GPIO_PDIR0_P3                         *((volatile  uint8_t *)(0x4266600CUL))
#define bFM0P_GPIO_PDIR0_P3                       *((volatile  uint8_t *)(0x4266600CUL))
#define bFM_GPIO_PDIR0_P4                         *((volatile  uint8_t *)(0x42666010UL))
#define bFM0P_GPIO_PDIR0_P4                       *((volatile  uint8_t *)(0x42666010UL))
#define bFM_GPIO_PDIR0_P7                         *((volatile  uint8_t *)(0x4266601CUL))
#define bFM0P_GPIO_PDIR0_P7                       *((volatile  uint8_t *)(0x4266601CUL))
#define bFM_GPIO_PDIR0_PA                         *((volatile  uint8_t *)(0x42666028UL))
#define bFM0P_GPIO_PDIR0_PA                       *((volatile  uint8_t *)(0x42666028UL))
#define bFM_GPIO_PDIR0_PB                         *((volatile  uint8_t *)(0x4266602CUL))
#define bFM0P_GPIO_PDIR0_PB                       *((volatile  uint8_t *)(0x4266602CUL))
#define bFM_GPIO_PDIR0_PC                         *((volatile  uint8_t *)(0x42666030UL))
#define bFM0P_GPIO_PDIR0_PC                       *((volatile  uint8_t *)(0x42666030UL))
#define bFM_GPIO_PDIR0_PD                         *((volatile  uint8_t *)(0x42666034UL))
#define bFM0P_GPIO_PDIR0_PD                       *((volatile  uint8_t *)(0x42666034UL))
#define bFM_GPIO_PDIR0_PE                         *((volatile  uint8_t *)(0x42666038UL))
#define bFM0P_GPIO_PDIR0_PE                       *((volatile  uint8_t *)(0x42666038UL))
#define bFM_GPIO_PDIR0_PF                         *((volatile  uint8_t *)(0x4266603CUL))
#define bFM0P_GPIO_PDIR0_PF                       *((volatile  uint8_t *)(0x4266603CUL))

#define bFM_GPIO_PDIR1_P0                         *((volatile  uint8_t *)(0x42666080UL))
#define bFM0P_GPIO_PDIR1_P0                       *((volatile  uint8_t *)(0x42666080UL))
#define bFM_GPIO_PDIR1_P1                         *((volatile  uint8_t *)(0x42666084UL))
#define bFM0P_GPIO_PDIR1_P1                       *((volatile  uint8_t *)(0x42666084UL))
#define bFM_GPIO_PDIR1_P2                         *((volatile  uint8_t *)(0x42666088UL))
#define bFM0P_GPIO_PDIR1_P2                       *((volatile  uint8_t *)(0x42666088UL))
#define bFM_GPIO_PDIR1_P3                         *((volatile  uint8_t *)(0x4266608CUL))
#define bFM0P_GPIO_PDIR1_P3                       *((volatile  uint8_t *)(0x4266608CUL))
#define bFM_GPIO_PDIR1_P4                         *((volatile  uint8_t *)(0x42666090UL))
#define bFM0P_GPIO_PDIR1_P4                       *((volatile  uint8_t *)(0x42666090UL))
#define bFM_GPIO_PDIR1_P5                         *((volatile  uint8_t *)(0x42666094UL))
#define bFM0P_GPIO_PDIR1_P5                       *((volatile  uint8_t *)(0x42666094UL))
#define bFM_GPIO_PDIR1_P6                         *((volatile  uint8_t *)(0x42666098UL))
#define bFM0P_GPIO_PDIR1_P6                       *((volatile  uint8_t *)(0x42666098UL))
#define bFM_GPIO_PDIR1_P7                         *((volatile  uint8_t *)(0x4266609CUL))
#define bFM0P_GPIO_PDIR1_P7                       *((volatile  uint8_t *)(0x4266609CUL))
#define bFM_GPIO_PDIR1_P8                         *((volatile  uint8_t *)(0x426660A0UL))
#define bFM0P_GPIO_PDIR1_P8                       *((volatile  uint8_t *)(0x426660A0UL))
#define bFM_GPIO_PDIR1_P9                         *((volatile  uint8_t *)(0x426660A4UL))
#define bFM0P_GPIO_PDIR1_P9                       *((volatile  uint8_t *)(0x426660A4UL))
#define bFM_GPIO_PDIR1_PA                         *((volatile  uint8_t *)(0x426660A8UL))
#define bFM0P_GPIO_PDIR1_PA                       *((volatile  uint8_t *)(0x426660A8UL))
#define bFM_GPIO_PDIR1_PB                         *((volatile  uint8_t *)(0x426660ACUL))
#define bFM0P_GPIO_PDIR1_PB                       *((volatile  uint8_t *)(0x426660ACUL))

#define bFM_GPIO_PDIR2_P1                         *((volatile  uint8_t *)(0x42666104UL))
#define bFM0P_GPIO_PDIR2_P1                       *((volatile  uint8_t *)(0x42666104UL))
#define bFM_GPIO_PDIR2_P2                         *((volatile  uint8_t *)(0x42666108UL))
#define bFM0P_GPIO_PDIR2_P2                       *((volatile  uint8_t *)(0x42666108UL))
#define bFM_GPIO_PDIR2_P3                         *((volatile  uint8_t *)(0x4266610CUL))
#define bFM0P_GPIO_PDIR2_P3                       *((volatile  uint8_t *)(0x4266610CUL))

#define bFM_GPIO_PDIR3_P0                         *((volatile  uint8_t *)(0x42666180UL))
#define bFM0P_GPIO_PDIR3_P0                       *((volatile  uint8_t *)(0x42666180UL))
#define bFM_GPIO_PDIR3_P1                         *((volatile  uint8_t *)(0x42666184UL))
#define bFM0P_GPIO_PDIR3_P1                       *((volatile  uint8_t *)(0x42666184UL))
#define bFM_GPIO_PDIR3_P2                         *((volatile  uint8_t *)(0x42666188UL))
#define bFM0P_GPIO_PDIR3_P2                       *((volatile  uint8_t *)(0x42666188UL))
#define bFM_GPIO_PDIR3_P3                         *((volatile  uint8_t *)(0x4266618CUL))
#define bFM0P_GPIO_PDIR3_P3                       *((volatile  uint8_t *)(0x4266618CUL))
#define bFM_GPIO_PDIR3_P9                         *((volatile  uint8_t *)(0x426661A4UL))
#define bFM0P_GPIO_PDIR3_P9                       *((volatile  uint8_t *)(0x426661A4UL))
#define bFM_GPIO_PDIR3_PA                         *((volatile  uint8_t *)(0x426661A8UL))
#define bFM0P_GPIO_PDIR3_PA                       *((volatile  uint8_t *)(0x426661A8UL))
#define bFM_GPIO_PDIR3_PB                         *((volatile  uint8_t *)(0x426661ACUL))
#define bFM0P_GPIO_PDIR3_PB                       *((volatile  uint8_t *)(0x426661ACUL))
#define bFM_GPIO_PDIR3_PC                         *((volatile  uint8_t *)(0x426661B0UL))
#define bFM0P_GPIO_PDIR3_PC                       *((volatile  uint8_t *)(0x426661B0UL))
#define bFM_GPIO_PDIR3_PD                         *((volatile  uint8_t *)(0x426661B4UL))
#define bFM0P_GPIO_PDIR3_PD                       *((volatile  uint8_t *)(0x426661B4UL))
#define bFM_GPIO_PDIR3_PE                         *((volatile  uint8_t *)(0x426661B8UL))
#define bFM0P_GPIO_PDIR3_PE                       *((volatile  uint8_t *)(0x426661B8UL))
#define bFM_GPIO_PDIR3_PF                         *((volatile  uint8_t *)(0x426661BCUL))
#define bFM0P_GPIO_PDIR3_PF                       *((volatile  uint8_t *)(0x426661BCUL))

#define bFM_GPIO_PDIR4_P4                         *((volatile  uint8_t *)(0x42666210UL))
#define bFM0P_GPIO_PDIR4_P4                       *((volatile  uint8_t *)(0x42666210UL))
#define bFM_GPIO_PDIR4_P5                         *((volatile  uint8_t *)(0x42666214UL))
#define bFM0P_GPIO_PDIR4_P5                       *((volatile  uint8_t *)(0x42666214UL))
#define bFM_GPIO_PDIR4_P6                         *((volatile  uint8_t *)(0x42666218UL))
#define bFM0P_GPIO_PDIR4_P6                       *((volatile  uint8_t *)(0x42666218UL))
#define bFM_GPIO_PDIR4_P7                         *((volatile  uint8_t *)(0x4266621CUL))
#define bFM0P_GPIO_PDIR4_P7                       *((volatile  uint8_t *)(0x4266621CUL))
#define bFM_GPIO_PDIR4_P8                         *((volatile  uint8_t *)(0x42666220UL))
#define bFM0P_GPIO_PDIR4_P8                       *((volatile  uint8_t *)(0x42666220UL))
#define bFM_GPIO_PDIR4_P9                         *((volatile  uint8_t *)(0x42666224UL))
#define bFM0P_GPIO_PDIR4_P9                       *((volatile  uint8_t *)(0x42666224UL))
#define bFM_GPIO_PDIR4_PA                         *((volatile  uint8_t *)(0x42666228UL))
#define bFM0P_GPIO_PDIR4_PA                       *((volatile  uint8_t *)(0x42666228UL))
#define bFM_GPIO_PDIR4_PB                         *((volatile  uint8_t *)(0x4266622CUL))
#define bFM0P_GPIO_PDIR4_PB                       *((volatile  uint8_t *)(0x4266622CUL))
#define bFM_GPIO_PDIR4_PC                         *((volatile  uint8_t *)(0x42666230UL))
#define bFM0P_GPIO_PDIR4_PC                       *((volatile  uint8_t *)(0x42666230UL))
#define bFM_GPIO_PDIR4_PD                         *((volatile  uint8_t *)(0x42666234UL))
#define bFM0P_GPIO_PDIR4_PD                       *((volatile  uint8_t *)(0x42666234UL))

#define bFM_GPIO_PDIR5_P0                         *((volatile  uint8_t *)(0x42666280UL))
#define bFM0P_GPIO_PDIR5_P0                       *((volatile  uint8_t *)(0x42666280UL))
#define bFM_GPIO_PDIR5_P1                         *((volatile  uint8_t *)(0x42666284UL))
#define bFM0P_GPIO_PDIR5_P1                       *((volatile  uint8_t *)(0x42666284UL))
#define bFM_GPIO_PDIR5_P2                         *((volatile  uint8_t *)(0x42666288UL))
#define bFM0P_GPIO_PDIR5_P2                       *((volatile  uint8_t *)(0x42666288UL))
#define bFM_GPIO_PDIR5_P3                         *((volatile  uint8_t *)(0x4266628CUL))
#define bFM0P_GPIO_PDIR5_P3                       *((volatile  uint8_t *)(0x4266628CUL))
#define bFM_GPIO_PDIR5_P4                         *((volatile  uint8_t *)(0x42666290UL))
#define bFM0P_GPIO_PDIR5_P4                       *((volatile  uint8_t *)(0x42666290UL))
#define bFM_GPIO_PDIR5_P5                         *((volatile  uint8_t *)(0x42666294UL))
#define bFM0P_GPIO_PDIR5_P5                       *((volatile  uint8_t *)(0x42666294UL))
#define bFM_GPIO_PDIR5_P6                         *((volatile  uint8_t *)(0x42666298UL))
#define bFM0P_GPIO_PDIR5_P6                       *((volatile  uint8_t *)(0x42666298UL))

#define bFM_GPIO_PDIR6_P0                         *((volatile  uint8_t *)(0x42666300UL))
#define bFM0P_GPIO_PDIR6_P0                       *((volatile  uint8_t *)(0x42666300UL))
#define bFM_GPIO_PDIR6_P1                         *((volatile  uint8_t *)(0x42666304UL))
#define bFM0P_GPIO_PDIR6_P1                       *((volatile  uint8_t *)(0x42666304UL))
#define bFM_GPIO_PDIR6_P2                         *((volatile  uint8_t *)(0x42666308UL))
#define bFM0P_GPIO_PDIR6_P2                       *((volatile  uint8_t *)(0x42666308UL))
#define bFM_GPIO_PDIR6_P3                         *((volatile  uint8_t *)(0x4266630CUL))
#define bFM0P_GPIO_PDIR6_P3                       *((volatile  uint8_t *)(0x4266630CUL))

#define bFM_GPIO_PDIR8_P0                         *((volatile  uint8_t *)(0x42666400UL))
#define bFM0P_GPIO_PDIR8_P0                       *((volatile  uint8_t *)(0x42666400UL))
#define bFM_GPIO_PDIR8_P1                         *((volatile  uint8_t *)(0x42666404UL))
#define bFM0P_GPIO_PDIR8_P1                       *((volatile  uint8_t *)(0x42666404UL))
#define bFM_GPIO_PDIR8_P2                         *((volatile  uint8_t *)(0x42666408UL))
#define bFM0P_GPIO_PDIR8_P2                       *((volatile  uint8_t *)(0x42666408UL))

#define bFM_GPIO_PDIRE_P0                         *((volatile  uint8_t *)(0x42666700UL))
#define bFM0P_GPIO_PDIRE_P0                       *((volatile  uint8_t *)(0x42666700UL))
#define bFM_GPIO_PDIRE_P2                         *((volatile  uint8_t *)(0x42666708UL))
#define bFM0P_GPIO_PDIRE_P2                       *((volatile  uint8_t *)(0x42666708UL))
#define bFM_GPIO_PDIRE_P3                         *((volatile  uint8_t *)(0x4266670CUL))
#define bFM0P_GPIO_PDIRE_P3                       *((volatile  uint8_t *)(0x4266670CUL))

#define bFM_GPIO_PDOR0_P0                         *((volatile  uint8_t *)(0x42668000UL))
#define bFM0P_GPIO_PDOR0_P0                       *((volatile  uint8_t *)(0x42668000UL))
#define bFM_GPIO_PDOR0_P1                         *((volatile  uint8_t *)(0x42668004UL))
#define bFM0P_GPIO_PDOR0_P1                       *((volatile  uint8_t *)(0x42668004UL))
#define bFM_GPIO_PDOR0_P2                         *((volatile  uint8_t *)(0x42668008UL))
#define bFM0P_GPIO_PDOR0_P2                       *((volatile  uint8_t *)(0x42668008UL))
#define bFM_GPIO_PDOR0_P3                         *((volatile  uint8_t *)(0x4266800CUL))
#define bFM0P_GPIO_PDOR0_P3                       *((volatile  uint8_t *)(0x4266800CUL))
#define bFM_GPIO_PDOR0_P4                         *((volatile  uint8_t *)(0x42668010UL))
#define bFM0P_GPIO_PDOR0_P4                       *((volatile  uint8_t *)(0x42668010UL))
#define bFM_GPIO_PDOR0_P7                         *((volatile  uint8_t *)(0x4266801CUL))
#define bFM0P_GPIO_PDOR0_P7                       *((volatile  uint8_t *)(0x4266801CUL))
#define bFM_GPIO_PDOR0_PA                         *((volatile  uint8_t *)(0x42668028UL))
#define bFM0P_GPIO_PDOR0_PA                       *((volatile  uint8_t *)(0x42668028UL))
#define bFM_GPIO_PDOR0_PB                         *((volatile  uint8_t *)(0x4266802CUL))
#define bFM0P_GPIO_PDOR0_PB                       *((volatile  uint8_t *)(0x4266802CUL))
#define bFM_GPIO_PDOR0_PC                         *((volatile  uint8_t *)(0x42668030UL))
#define bFM0P_GPIO_PDOR0_PC                       *((volatile  uint8_t *)(0x42668030UL))
#define bFM_GPIO_PDOR0_PD                         *((volatile  uint8_t *)(0x42668034UL))
#define bFM0P_GPIO_PDOR0_PD                       *((volatile  uint8_t *)(0x42668034UL))
#define bFM_GPIO_PDOR0_PE                         *((volatile  uint8_t *)(0x42668038UL))
#define bFM0P_GPIO_PDOR0_PE                       *((volatile  uint8_t *)(0x42668038UL))
#define bFM_GPIO_PDOR0_PF                         *((volatile  uint8_t *)(0x4266803CUL))
#define bFM0P_GPIO_PDOR0_PF                       *((volatile  uint8_t *)(0x4266803CUL))

#define bFM_GPIO_PDOR1_P0                         *((volatile  uint8_t *)(0x42668080UL))
#define bFM0P_GPIO_PDOR1_P0                       *((volatile  uint8_t *)(0x42668080UL))
#define bFM_GPIO_PDOR1_P1                         *((volatile  uint8_t *)(0x42668084UL))
#define bFM0P_GPIO_PDOR1_P1                       *((volatile  uint8_t *)(0x42668084UL))
#define bFM_GPIO_PDOR1_P2                         *((volatile  uint8_t *)(0x42668088UL))
#define bFM0P_GPIO_PDOR1_P2                       *((volatile  uint8_t *)(0x42668088UL))
#define bFM_GPIO_PDOR1_P3                         *((volatile  uint8_t *)(0x4266808CUL))
#define bFM0P_GPIO_PDOR1_P3                       *((volatile  uint8_t *)(0x4266808CUL))
#define bFM_GPIO_PDOR1_P4                         *((volatile  uint8_t *)(0x42668090UL))
#define bFM0P_GPIO_PDOR1_P4                       *((volatile  uint8_t *)(0x42668090UL))
#define bFM_GPIO_PDOR1_P5                         *((volatile  uint8_t *)(0x42668094UL))
#define bFM0P_GPIO_PDOR1_P5                       *((volatile  uint8_t *)(0x42668094UL))
#define bFM_GPIO_PDOR1_P6                         *((volatile  uint8_t *)(0x42668098UL))
#define bFM0P_GPIO_PDOR1_P6                       *((volatile  uint8_t *)(0x42668098UL))
#define bFM_GPIO_PDOR1_P7                         *((volatile  uint8_t *)(0x4266809CUL))
#define bFM0P_GPIO_PDOR1_P7                       *((volatile  uint8_t *)(0x4266809CUL))
#define bFM_GPIO_PDOR1_P8                         *((volatile  uint8_t *)(0x426680A0UL))
#define bFM0P_GPIO_PDOR1_P8                       *((volatile  uint8_t *)(0x426680A0UL))
#define bFM_GPIO_PDOR1_P9                         *((volatile  uint8_t *)(0x426680A4UL))
#define bFM0P_GPIO_PDOR1_P9                       *((volatile  uint8_t *)(0x426680A4UL))
#define bFM_GPIO_PDOR1_PA                         *((volatile  uint8_t *)(0x426680A8UL))
#define bFM0P_GPIO_PDOR1_PA                       *((volatile  uint8_t *)(0x426680A8UL))
#define bFM_GPIO_PDOR1_PB                         *((volatile  uint8_t *)(0x426680ACUL))
#define bFM0P_GPIO_PDOR1_PB                       *((volatile  uint8_t *)(0x426680ACUL))

#define bFM_GPIO_PDOR2_P1                         *((volatile  uint8_t *)(0x42668104UL))
#define bFM0P_GPIO_PDOR2_P1                       *((volatile  uint8_t *)(0x42668104UL))
#define bFM_GPIO_PDOR2_P2                         *((volatile  uint8_t *)(0x42668108UL))
#define bFM0P_GPIO_PDOR2_P2                       *((volatile  uint8_t *)(0x42668108UL))
#define bFM_GPIO_PDOR2_P3                         *((volatile  uint8_t *)(0x4266810CUL))
#define bFM0P_GPIO_PDOR2_P3                       *((volatile  uint8_t *)(0x4266810CUL))

#define bFM_GPIO_PDOR3_P0                         *((volatile  uint8_t *)(0x42668180UL))
#define bFM0P_GPIO_PDOR3_P0                       *((volatile  uint8_t *)(0x42668180UL))
#define bFM_GPIO_PDOR3_P1                         *((volatile  uint8_t *)(0x42668184UL))
#define bFM0P_GPIO_PDOR3_P1                       *((volatile  uint8_t *)(0x42668184UL))
#define bFM_GPIO_PDOR3_P2                         *((volatile  uint8_t *)(0x42668188UL))
#define bFM0P_GPIO_PDOR3_P2                       *((volatile  uint8_t *)(0x42668188UL))
#define bFM_GPIO_PDOR3_P3                         *((volatile  uint8_t *)(0x4266818CUL))
#define bFM0P_GPIO_PDOR3_P3                       *((volatile  uint8_t *)(0x4266818CUL))
#define bFM_GPIO_PDOR3_P9                         *((volatile  uint8_t *)(0x426681A4UL))
#define bFM0P_GPIO_PDOR3_P9                       *((volatile  uint8_t *)(0x426681A4UL))
#define bFM_GPIO_PDOR3_PA                         *((volatile  uint8_t *)(0x426681A8UL))
#define bFM0P_GPIO_PDOR3_PA                       *((volatile  uint8_t *)(0x426681A8UL))
#define bFM_GPIO_PDOR3_PB                         *((volatile  uint8_t *)(0x426681ACUL))
#define bFM0P_GPIO_PDOR3_PB                       *((volatile  uint8_t *)(0x426681ACUL))
#define bFM_GPIO_PDOR3_PC                         *((volatile  uint8_t *)(0x426681B0UL))
#define bFM0P_GPIO_PDOR3_PC                       *((volatile  uint8_t *)(0x426681B0UL))
#define bFM_GPIO_PDOR3_PD                         *((volatile  uint8_t *)(0x426681B4UL))
#define bFM0P_GPIO_PDOR3_PD                       *((volatile  uint8_t *)(0x426681B4UL))
#define bFM_GPIO_PDOR3_PE                         *((volatile  uint8_t *)(0x426681B8UL))
#define bFM0P_GPIO_PDOR3_PE                       *((volatile  uint8_t *)(0x426681B8UL))
#define bFM_GPIO_PDOR3_PF                         *((volatile  uint8_t *)(0x426681BCUL))
#define bFM0P_GPIO_PDOR3_PF                       *((volatile  uint8_t *)(0x426681BCUL))

