mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xe/common/s6e1b8xe.h
#define bFM_LCDC_LCDCC3_VE0                       *((volatile  uint8_t *)(0x42640044UL))
#define bFM0P_LCDC_LCDCC3_VE0                     *((volatile  uint8_t *)(0x42640044UL))
#define bFM_LCDC_LCDCC3_VE1                       *((volatile  uint8_t *)(0x42640048UL))
#define bFM0P_LCDC_LCDCC3_VE1                     *((volatile  uint8_t *)(0x42640048UL))
#define bFM_LCDC_LCDCC3_VE2                       *((volatile  uint8_t *)(0x4264004CUL))
#define bFM0P_LCDC_LCDCC3_VE2                     *((volatile  uint8_t *)(0x4264004CUL))
#define bFM_LCDC_LCDCC3_VE3                       *((volatile  uint8_t *)(0x42640050UL))
#define bFM0P_LCDC_LCDCC3_VE3                     *((volatile  uint8_t *)(0x42640050UL))
#define bFM_LCDC_LCDCC3_VE4                       *((volatile  uint8_t *)(0x42640054UL))
#define bFM0P_LCDC_LCDCC3_VE4                     *((volatile  uint8_t *)(0x42640054UL))
#define bFM_LCDC_LCDCC3_BLSEL                     *((volatile  uint8_t *)(0x42640058UL))
#define bFM0P_LCDC_LCDCC3_BLSEL                   *((volatile  uint8_t *)(0x42640058UL))
#define bFM_LCDC_LCDCC3_PICTL                     *((volatile  uint8_t *)(0x4264005CUL))
#define bFM0P_LCDC_LCDCC3_PICTL                   *((volatile  uint8_t *)(0x4264005CUL))


/*******************************************************************************
* LSCRP Registers LSCRP
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* LVD Registers LVD
*   Bitband Section
*******************************************************************************/
#define bFM_LVD_LVD_CLR_LVDCL                     *((volatile  uint8_t *)(0x426A011CUL))
#define bFM0P_LVD_LVD_CLR_LVDCL                   *((volatile  uint8_t *)(0x426A011CUL))
#define bFM_LVD_LVD_CLR_LVD2CL                    *((volatile  uint8_t *)(0x426A013CUL))
#define bFM0P_LVD_LVD_CLR_LVD2CL                  *((volatile  uint8_t *)(0x426A013CUL))

#define bFM_LVD_LVD_CTL_LVDIE                     *((volatile  uint8_t *)(0x426A001CUL))
#define bFM0P_LVD_LVD_CTL_LVDIE                   *((volatile  uint8_t *)(0x426A001CUL))
#define bFM_LVD_LVD_CTL_LVDRE                     *((volatile  uint8_t *)(0x426A003CUL))
#define bFM0P_LVD_LVD_CTL_LVDRE                   *((volatile  uint8_t *)(0x426A003CUL))

#define bFM_LVD_LVD_CTL2_LVDRLIE                  *((volatile  uint8_t *)(0x426A029CUL))
#define bFM0P_LVD_LVD_CTL2_LVDRLIE                *((volatile  uint8_t *)(0x426A029CUL))
#define bFM_LVD_LVD_CTL2_LVDPOL                   *((volatile  uint8_t *)(0x426A02A0UL))
#define bFM0P_LVD_LVD_CTL2_LVDPOL                 *((volatile  uint8_t *)(0x426A02A0UL))

#define bFM_LVD_LVD_STR_LVDHSTR                   *((volatile  uint8_t *)(0x426A0080UL))
#define bFM0P_LVD_LVD_STR_LVDHSTR                 *((volatile  uint8_t *)(0x426A0080UL))
#define bFM_LVD_LVD_STR_LVDIR                     *((volatile  uint8_t *)(0x426A009CUL))
#define bFM0P_LVD_LVD_STR_LVDIR                   *((volatile  uint8_t *)(0x426A009CUL))
#define bFM_LVD_LVD_STR_LVD2HSTR                  *((volatile  uint8_t *)(0x426A00A0UL))
#define bFM0P_LVD_LVD_STR_LVD2HSTR                *((volatile  uint8_t *)(0x426A00A0UL))
#define bFM_LVD_LVD_STR_LVD2IR                    *((volatile  uint8_t *)(0x426A00BCUL))
#define bFM0P_LVD_LVD_STR_LVD2IR                  *((volatile  uint8_t *)(0x426A00BCUL))

#define bFM_LVD_LVD_STR2_LVDRRDY                  *((volatile  uint8_t *)(0x426A0218UL))
#define bFM0P_LVD_LVD_STR2_LVDRRDY                *((volatile  uint8_t *)(0x426A0218UL))
#define bFM_LVD_LVD_STR2_LVDIRDY                  *((volatile  uint8_t *)(0x426A021CUL))
#define bFM0P_LVD_LVD_STR2_LVDIRDY                *((volatile  uint8_t *)(0x426A021CUL))
#define bFM_LVD_LVD_STR2_LVD2IRDY                 *((volatile  uint8_t *)(0x426A023CUL))
#define bFM0P_LVD_LVD_STR2_LVD2IRDY               *((volatile  uint8_t *)(0x426A023CUL))

#define bFM_LVD_LVD2_CTL_LVD2IE                   *((volatile  uint8_t *)(0x426A031CUL))
#define bFM0P_LVD_LVD2_CTL_LVD2IE                 *((volatile  uint8_t *)(0x426A031CUL))

#define bFM_LVD_LVD2_CTL2_LVD2RLIE                *((volatile  uint8_t *)(0x426A039CUL))
#define bFM0P_LVD_LVD2_CTL2_LVD2RLIE              *((volatile  uint8_t *)(0x426A039CUL))
#define bFM_LVD_LVD2_CTL2_LVD2POL                 *((volatile  uint8_t *)(0x426A03A0UL))
#define bFM0P_LVD_LVD2_CTL2_LVD2POL               *((volatile  uint8_t *)(0x426A03A0UL))


/*******************************************************************************
* MFS Registers MFS0
*   Bitband Section
*******************************************************************************/
#define bFM_MFS0_CSIO_ESCR_CSFE                   *((volatile  uint8_t *)(0x42700094UL))
#define bFM0P_MFS0_CSIO_ESCR_CSFE                 *((volatile  uint8_t *)(0x42700094UL))
#define bFM_MFS0_CSIO_ESCR_L3                     *((volatile  uint8_t *)(0x42700098UL))
#define bFM0P_MFS0_CSIO_ESCR_L3                   *((volatile  uint8_t *)(0x42700098UL))
#define bFM_MFS0_CSIO_ESCR_SOP                    *((volatile  uint8_t *)(0x4270009CUL))
#define bFM0P_MFS0_CSIO_ESCR_SOP                  *((volatile  uint8_t *)(0x4270009CUL))

#define bFM_MFS0_CSIO_FCR_FE1                     *((volatile  uint8_t *)(0x42700280UL))
#define bFM0P_MFS0_CSIO_FCR_FE1                   *((volatile  uint8_t *)(0x42700280UL))
#define bFM_MFS0_CSIO_FCR_FE2                     *((volatile  uint8_t *)(0x42700284UL))
#define bFM0P_MFS0_CSIO_FCR_FE2                   *((volatile  uint8_t *)(0x42700284UL))
#define bFM_MFS0_CSIO_FCR_FCL1                    *((volatile  uint8_t *)(0x42700288UL))
#define bFM0P_MFS0_CSIO_FCR_FCL1                  *((volatile  uint8_t *)(0x42700288UL))
#define bFM_MFS0_CSIO_FCR_FCL2                    *((volatile  uint8_t *)(0x4270028CUL))
#define bFM0P_MFS0_CSIO_FCR_FCL2                  *((volatile  uint8_t *)(0x4270028CUL))
#define bFM_MFS0_CSIO_FCR_FSET                    *((volatile  uint8_t *)(0x42700290UL))
#define bFM0P_MFS0_CSIO_FCR_FSET                  *((volatile  uint8_t *)(0x42700290UL))
#define bFM_MFS0_CSIO_FCR_FLD                     *((volatile  uint8_t *)(0x42700294UL))
#define bFM0P_MFS0_CSIO_FCR_FLD                   *((volatile  uint8_t *)(0x42700294UL))
#define bFM_MFS0_CSIO_FCR_FLST                    *((volatile  uint8_t *)(0x42700298UL))
#define bFM0P_MFS0_CSIO_FCR_FLST                  *((volatile  uint8_t *)(0x42700298UL))
#define bFM_MFS0_CSIO_FCR_FSEL                    *((volatile  uint8_t *)(0x427002A0UL))
#define bFM0P_MFS0_CSIO_FCR_FSEL                  *((volatile  uint8_t *)(0x427002A0UL))
#define bFM_MFS0_CSIO_FCR_FTIE                    *((volatile  uint8_t *)(0x427002A4UL))
#define bFM0P_MFS0_CSIO_FCR_FTIE                  *((volatile  uint8_t *)(0x427002A4UL))
#define bFM_MFS0_CSIO_FCR_FDRQ                    *((volatile  uint8_t *)(0x427002A8UL))
#define bFM0P_MFS0_CSIO_FCR_FDRQ                  *((volatile  uint8_t *)(0x427002A8UL))
#define bFM_MFS0_CSIO_FCR_FRIIE                   *((volatile  uint8_t *)(0x427002ACUL))
#define bFM0P_MFS0_CSIO_FCR_FRIIE                 *((volatile  uint8_t *)(0x427002ACUL))
#define bFM_MFS0_CSIO_FCR_FLSTE                   *((volatile  uint8_t *)(0x427002B0UL))
#define bFM0P_MFS0_CSIO_FCR_FLSTE                 *((volatile  uint8_t *)(0x427002B0UL))

