mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xe/common/s6e1b8xe.h
/*******************************************************************************
* SMCIF Registers SMCIF1
*   Bitband Section
*******************************************************************************/
#define bFM_SMCIF1_BAUDRATE_LITTLESTEP            *((volatile  uint16_t*)(0x427932BCUL))
#define bFM0P_SMCIF1_BAUDRATE_LITTLESTEP          *((volatile  uint16_t*)(0x427932BCUL))

#define bFM_SMCIF1_FIFO_CLEAR_MSB_READ_CLRRDFIFO  *((volatile  uint16_t*)(0x42793700UL))
#define bFM0P_SMCIF1_FIFO_CLEAR_MSB_READ_CLRRDFIFO *((volatile  uint16_t*)(0x42793700UL))

#define bFM_SMCIF1_FIFO_CLEAR_MSB_WRITE_CLRWRFIFO *((volatile  uint16_t*)(0x42793680UL))
#define bFM0P_SMCIF1_FIFO_CLEAR_MSB_WRITE_CLRWRFIFO *((volatile  uint16_t*)(0x42793680UL))

#define bFM_SMCIF1_FIFO_MODE_FIFOEN               *((volatile  uint16_t*)(0x42793600UL))
#define bFM0P_SMCIF1_FIFO_MODE_FIFOEN             *((volatile  uint16_t*)(0x42793600UL))
#define bFM_SMCIF1_FIFO_MODE_RDFIFOOVRIRQEN       *((volatile  uint16_t*)(0x42793604UL))
#define bFM0P_SMCIF1_FIFO_MODE_RDFIFOOVRIRQEN     *((volatile  uint16_t*)(0x42793604UL))
#define bFM_SMCIF1_FIFO_MODE_WRFIFOIRQEN          *((volatile  uint16_t*)(0x42793608UL))
#define bFM0P_SMCIF1_FIFO_MODE_WRFIFOIRQEN        *((volatile  uint16_t*)(0x42793608UL))
#define bFM_SMCIF1_FIFO_MODE_RDFIFOIRQEN          *((volatile  uint16_t*)(0x4279360CUL))
#define bFM0P_SMCIF1_FIFO_MODE_RDFIFOIRQEN        *((volatile  uint16_t*)(0x4279360CUL))

#define bFM_SMCIF1_GLOBALCONTROL1_PARITY          *((volatile  uint16_t*)(0x42793000UL))
#define bFM0P_SMCIF1_GLOBALCONTROL1_PARITY        *((volatile  uint16_t*)(0x42793000UL))
#define bFM_SMCIF1_GLOBALCONTROL1_FRM0            *((volatile  uint16_t*)(0x42793004UL))
#define bFM0P_SMCIF1_GLOBALCONTROL1_FRM0          *((volatile  uint16_t*)(0x42793004UL))
#define bFM_SMCIF1_GLOBALCONTROL1_FRM1            *((volatile  uint16_t*)(0x42793008UL))
#define bFM0P_SMCIF1_GLOBALCONTROL1_FRM1          *((volatile  uint16_t*)(0x42793008UL))
#define bFM_SMCIF1_GLOBALCONTROL1_MODE8N1         *((volatile  uint16_t*)(0x4279300CUL))
#define bFM0P_SMCIF1_GLOBALCONTROL1_MODE8N1       *((volatile  uint16_t*)(0x4279300CUL))
#define bFM_SMCIF1_GLOBALCONTROL1_MASKRXFUL       *((volatile  uint16_t*)(0x42793010UL))
#define bFM0P_SMCIF1_GLOBALCONTROL1_MASKRXFUL     *((volatile  uint16_t*)(0x42793010UL))
#define bFM_SMCIF1_GLOBALCONTROL1_MASKTXEMP       *((volatile  uint16_t*)(0x42793014UL))
#define bFM0P_SMCIF1_GLOBALCONTROL1_MASKTXEMP     *((volatile  uint16_t*)(0x42793014UL))
#define bFM_SMCIF1_GLOBALCONTROL1_MASKSTI         *((volatile  uint16_t*)(0x42793018UL))
#define bFM0P_SMCIF1_GLOBALCONTROL1_MASKSTI       *((volatile  uint16_t*)(0x42793018UL))
#define bFM_SMCIF1_GLOBALCONTROL1_MASKCAEVENT     *((volatile  uint16_t*)(0x4279301CUL))
#define bFM0P_SMCIF1_GLOBALCONTROL1_MASKCAEVENT   *((volatile  uint16_t*)(0x4279301CUL))
#define bFM_SMCIF1_GLOBALCONTROL1_MASKITEXP       *((volatile  uint16_t*)(0x42793020UL))
#define bFM0P_SMCIF1_GLOBALCONTROL1_MASKITEXP     *((volatile  uint16_t*)(0x42793020UL))
#define bFM_SMCIF1_GLOBALCONTROL1_IOMOD           *((volatile  uint16_t*)(0x42793024UL))
#define bFM0P_SMCIF1_GLOBALCONTROL1_IOMOD         *((volatile  uint16_t*)(0x42793024UL))
#define bFM_SMCIF1_GLOBALCONTROL1_CKMOD           *((volatile  uint16_t*)(0x42793028UL))
#define bFM0P_SMCIF1_GLOBALCONTROL1_CKMOD         *((volatile  uint16_t*)(0x42793028UL))
#define bFM_SMCIF1_GLOBALCONTROL1_RESND           *((volatile  uint16_t*)(0x4279302CUL))
#define bFM0P_SMCIF1_GLOBALCONTROL1_RESND         *((volatile  uint16_t*)(0x4279302CUL))
#define bFM_SMCIF1_GLOBALCONTROL1_GUAEN           *((volatile  uint16_t*)(0x42793030UL))
#define bFM0P_SMCIF1_GLOBALCONTROL1_GUAEN         *((volatile  uint16_t*)(0x42793030UL))
#define bFM_SMCIF1_GLOBALCONTROL1_STIDT           *((volatile  uint16_t*)(0x42793034UL))
#define bFM0P_SMCIF1_GLOBALCONTROL1_STIDT         *((volatile  uint16_t*)(0x42793034UL))
#define bFM_SMCIF1_GLOBALCONTROL1_IDTSC           *((volatile  uint16_t*)(0x42793038UL))
#define bFM0P_SMCIF1_GLOBALCONTROL1_IDTSC         *((volatile  uint16_t*)(0x42793038UL))

#define bFM_SMCIF1_GLOBALCONTROL2_RX8N1           *((volatile  uint16_t*)(0x42793400UL))
#define bFM0P_SMCIF1_GLOBALCONTROL2_RX8N1         *((volatile  uint16_t*)(0x42793400UL))
#define bFM_SMCIF1_GLOBALCONTROL2_INVDATAOUT      *((volatile  uint16_t*)(0x42793404UL))
#define bFM0P_SMCIF1_GLOBALCONTROL2_INVDATAOUT    *((volatile  uint16_t*)(0x42793404UL))
#define bFM_SMCIF1_GLOBALCONTROL2_ICCDISABLE      *((volatile  uint16_t*)(0x4279340CUL))
#define bFM0P_SMCIF1_GLOBALCONTROL2_ICCDISABLE    *((volatile  uint16_t*)(0x4279340CUL))

#define bFM_SMCIF1_IRQ_STATUS_RDFIFOOVRIRQ        *((volatile  uint16_t*)(0x42793800UL))
#define bFM0P_SMCIF1_IRQ_STATUS_RDFIFOOVRIRQ      *((volatile  uint16_t*)(0x42793800UL))
#define bFM_SMCIF1_IRQ_STATUS_WRFIFOIRQ           *((volatile  uint16_t*)(0x42793804UL))
#define bFM0P_SMCIF1_IRQ_STATUS_WRFIFOIRQ         *((volatile  uint16_t*)(0x42793804UL))
#define bFM_SMCIF1_IRQ_STATUS_RDFIFOIRQ           *((volatile  uint16_t*)(0x42793808UL))
#define bFM0P_SMCIF1_IRQ_STATUS_RDFIFOIRQ         *((volatile  uint16_t*)(0x42793808UL))
#define bFM_SMCIF1_IRQ_STATUS_IDTEXPIRQ           *((volatile  uint16_t*)(0x4279380CUL))
#define bFM0P_SMCIF1_IRQ_STATUS_IDTEXPIRQ         *((volatile  uint16_t*)(0x4279380CUL))
#define bFM_SMCIF1_IRQ_STATUS_CARDEVENTIRQ        *((volatile  uint16_t*)(0x42793810UL))
#define bFM0P_SMCIF1_IRQ_STATUS_CARDEVENTIRQ      *((volatile  uint16_t*)(0x42793810UL))
#define bFM_SMCIF1_IRQ_STATUS_RXSTBIIRQ           *((volatile  uint16_t*)(0x42793814UL))
#define bFM0P_SMCIF1_IRQ_STATUS_RXSTBIIRQ         *((volatile  uint16_t*)(0x42793814UL))
#define bFM_SMCIF1_IRQ_STATUS_TXEMPIRQ            *((volatile  uint16_t*)(0x42793818UL))
#define bFM0P_SMCIF1_IRQ_STATUS_TXEMPIRQ          *((volatile  uint16_t*)(0x42793818UL))
#define bFM_SMCIF1_IRQ_STATUS_RXFULIRQ            *((volatile  uint16_t*)(0x4279381CUL))
#define bFM0P_SMCIF1_IRQ_STATUS_RXFULIRQ          *((volatile  uint16_t*)(0x4279381CUL))

#define bFM_SMCIF1_PORTCONTROL_TRIMOD             *((volatile  uint16_t*)(0x42793100UL))
#define bFM0P_SMCIF1_PORTCONTROL_TRIMOD           *((volatile  uint16_t*)(0x42793100UL))
#define bFM_SMCIF1_PORTCONTROL_IO1                *((volatile  uint16_t*)(0x42793108UL))
#define bFM0P_SMCIF1_PORTCONTROL_IO1              *((volatile  uint16_t*)(0x42793108UL))
#define bFM_SMCIF1_PORTCONTROL_IO1EN              *((volatile  uint16_t*)(0x42793110UL))
#define bFM0P_SMCIF1_PORTCONTROL_IO1EN            *((volatile  uint16_t*)(0x42793110UL))
#define bFM_SMCIF1_PORTCONTROL_CLKPT              *((volatile  uint16_t*)(0x42793118UL))
#define bFM0P_SMCIF1_PORTCONTROL_CLKPT            *((volatile  uint16_t*)(0x42793118UL))
#define bFM_SMCIF1_PORTCONTROL_RST                *((volatile  uint16_t*)(0x4279311CUL))
#define bFM0P_SMCIF1_PORTCONTROL_RST              *((volatile  uint16_t*)(0x4279311CUL))
#define bFM_SMCIF1_PORTCONTROL_VCCEN              *((volatile  uint16_t*)(0x42793120UL))
#define bFM0P_SMCIF1_PORTCONTROL_VCCEN            *((volatile  uint16_t*)(0x42793120UL))
#define bFM_SMCIF1_PORTCONTROL_VPEN               *((volatile  uint16_t*)(0x42793124UL))
#define bFM0P_SMCIF1_PORTCONTROL_VPEN             *((volatile  uint16_t*)(0x42793124UL))
#define bFM_SMCIF1_PORTCONTROL_CLKOUTEN           *((volatile  uint16_t*)(0x42793130UL))
#define bFM0P_SMCIF1_PORTCONTROL_CLKOUTEN         *((volatile  uint16_t*)(0x42793130UL))
#define bFM_SMCIF1_PORTCONTROL_RSTOUTEN           *((volatile  uint16_t*)(0x42793134UL))
#define bFM0P_SMCIF1_PORTCONTROL_RSTOUTEN         *((volatile  uint16_t*)(0x42793134UL))
#define bFM_SMCIF1_PORTCONTROL_VCCOUTEN           *((volatile  uint16_t*)(0x42793138UL))
#define bFM0P_SMCIF1_PORTCONTROL_VCCOUTEN         *((volatile  uint16_t*)(0x42793138UL))
#define bFM_SMCIF1_PORTCONTROL_VPENOUTEN          *((volatile  uint16_t*)(0x4279313CUL))
#define bFM0P_SMCIF1_PORTCONTROL_VPENOUTEN        *((volatile  uint16_t*)(0x4279313CUL))

